challenges.org
**** Finger Trees
This code is based upon the article: [[http://apfelmus.nfshost.com/articles/monoid-fingertree.html][Monoids and fingertrees]] by Apfelmus.

#+BEGIN_SRC haskell :results output
  data Tree v a = Leaf v a
                | Branch v (Tree v a) (Tree v a)

  toList :: Tree v a -> [a]
  toList (Leaf _ x) = [x]
  toList (Branch _ xt yt) = toList xt ++ toList yt

  tag :: Tree v a -> v
  tag (Leaf v _) = v
  tag (Branch v _ _) = v


  -- Size trees with special constructors
  type Size = Int

  leaf :: a -> Tree Size a
  leaf x = Leaf 1 x

  branch :: Tree Size a -> Tree Size a -> Tree Size a
  branch xt yt = Branch (tag xt + tag yt) xt yt

  (!) :: Tree Size a -> Int -> a
  (!) (Leaf _ a) 0 = a
  (!) (Branch _ xt yt) n 
      | n < tag xt = xt ! n
      | otherwise  = yt ! (n - tag xt)

  fromList :: [a] -> Tree Size a
  fromList [x] = leaf x
  fromList xs = branch (fromList fh) (fromList sh)
      where
        (fh,sh) = splitAt (length xs `div` 2) xs


  -- Priority queue
  type Priority = Int

  leafp :: a -> Priority -> Tree Priority a
  leafp x p = Leaf p x

  branchp :: Tree Priority a -> Tree Priority a -> Tree Priority a
  branchp lt rt = Branch (min (tag lt) (tag rt)) lt rt

  winner :: Tree Priority a -> a
  winner (Leaf _ a) = a
  winner t@(Branch _ x y)
    | tag t == tag x = winner x
    | otherwise      = winner y

  fromListp :: [(a,Priority)] -> Tree Priority a
  fromListp [(x,p)] = leafp x p
  fromListp xs = branchp (fromListp fh) (fromListp sh)
      where
        (fh,sh) = splitAt (length xs `div` 2) xs


  -- Example main
  main :: IO ()
  main = do
    print $ fromList [7,5,2,6,4,9,1,3,8] ! 5
    print $ winner $ fromListp [("a",5),("b",7),("c",3),("d",4)]
#+END_SRC

#+RESULTS:
: 9
: c

**** Monoidal abstraction
We can abstract this into a monoid:

#+BEGIN_SRC haskell :results output

#+END_SRC

* Hackerrank
** Data Structures
*** Heap
**** Find the running median
#+BEGIN_SRC c++
#include<iostream>
#include<iomanip>
#include<vector>

using namespace std;

bool lesst(int a,int b) {return a < b;}
bool moret(int a,int b) {return a > b;}


void insert(vector<int>& max_heap, bool (*compare)(int,int), int a) {
  max_heap.push_back(a);
  int pointer = max_heap.size()-1;
  int parent = (pointer-1)/2;
  
  while (pointer != 0 and compare(max_heap[parent],max_heap[pointer])) {
    int swap = max_heap[pointer];
    max_heap[pointer] = max_heap[parent];
    max_heap[parent] = swap;

    pointer = parent;
    parent = (pointer-1)/2;
  }
}


// compare < max_heap -> lesser
// compare > min_heap -> greater
int pop(vector<int>& max_heap, bool (*compare)(int,int)) {
  int result = max_heap[0];
  max_heap[0] = max_heap[max_heap.size()-1];
  max_heap.resize(max_heap.size()-1);
  unsigned pointer = 0;
  bool change_left =
    ((pointer*2+1) < max_heap.size()) and compare(max_heap[pointer], max_heap[pointer*2+1]);
  bool change_right =
    ((pointer*2+2) < max_heap.size()) and compare(max_heap[pointer], max_heap[pointer*2+2]);
  
  while (change_left or change_right) {
    if (change_left and change_right) {
      if (compare(max_heap[pointer*2+1],max_heap[pointer*2+2]))
	change_left = false;
      else
	change_right = false;
    }
    if (change_left) {
    int swap = max_heap[pointer];
      max_heap[pointer] = max_heap[pointer*2+1];
      max_heap[pointer*2+1] = swap;
      pointer = pointer*2+1;
    }
    else if (change_right) {
      int swap = max_heap[pointer];
      max_heap[pointer] = max_heap[pointer*2+2];
      max_heap[pointer*2+2] = swap;
      pointer = pointer*2+2;
    }

    change_left =
      ((pointer*2+1) < max_heap.size()) and compare(max_heap[pointer], max_heap[pointer*2+1]);
    change_right =
      ((pointer*2+2) < max_heap.size()) and compare(max_heap[pointer], max_heap[pointer*2+2]);
  }

  return result;
}

int main() {
  cout << fixed << setprecision(1);
  int n; cin >> n;
  vector<int> max_heap;
  vector<int> min_heap;
  float median = 0;
  int diff = 0;
  int read;

  // First element
  cin >> read;
  max_heap.push_back(read);
  median = read;
  diff = 1;
  cout << float(median) << endl;

  // All elements
  for (int i=0; i<n-1; i++) {
    // Inserts new element
    cin >> read;
    
    if (read >= median) {
      insert(min_heap,moret,read);
      if (min_heap.size() > max_heap.size())
	insert(max_heap,lesst,pop(min_heap,moret));
    }

    if (read < median) {
      insert(max_heap,lesst,read);
      if (max_heap.size() > min_heap.size()+1)
	insert(min_heap,moret,pop(max_heap,lesst));
    }
    
    // Recomputes median
    if (i%2 == 0)
      median = (max_heap[0] + min_heap[0])/2.0;
    else
      median = (max_heap[0]);
    cout << float(median) << endl;

    // cerr << "max: [";
    // for (unsigned i=0; i<max_heap.size();i++)
    //   cerr <<max_heap[i] << ",";
    // cerr << "]\n";
    // cerr << "min: [";
    // for (unsigned i=0; i<min_heap.size();i++)
    //   cerr <<min_heap[i] << ",";
    // cerr << "]\n";
  }
}
#+END_SRC

** Functional Programming
*** Introduction
