docs/challenges.html
<li><a href="#org4279f0f">Monoidal abstraction</a></li>
</ul>
</li>
</ul>
</li>
</ul>
</li>
</ul>
</div>
</div>

<div id="outline-container-orgf5d5d79" class="outline-2">
<h2 id="orgf5d5d79">Hackerrank</h2>
<div class="outline-text-2" id="text-orgf5d5d79">
</div><div id="outline-container-org112108c" class="outline-3">
<h3 id="org112108c">Data Structures</h3>
<div class="outline-text-3" id="text-org112108c">
</div><div id="outline-container-org1c0bca0" class="outline-4">
<h4 id="org1c0bca0">Heap</h4>
<div class="outline-text-4" id="text-org1c0bca0">
</div><div id="outline-container-orgceba840" class="outline-5">
<h5 id="orgceba840">Find the running median</h5>
<div class="outline-text-5" id="text-orgceba840">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iomanip&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>

<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">lesst</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a</span>,<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">b</span>) {<span style="color: #8ac6f2; font-weight: bold;">return</span> a &lt; b;}
<span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">moret</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a</span>,<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">b</span>) {<span style="color: #8ac6f2; font-weight: bold;">return</span> a &gt; b;}


<span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">insert</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&amp; <span style="color: #cae682;">max_heap</span>, <span style="color: #92a65e; font-weight: bold;">bool</span> (*<span style="color: #cae682;">compare</span>)(<span style="color: #92a65e; font-weight: bold;">int</span>,<span style="color: #92a65e; font-weight: bold;">int</span>), <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a</span>) {
  max_heap.push_back(a);
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">pointer</span> = max_heap.size()-1;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">parent</span> = (pointer-1)/2;
  
  <span style="color: #8ac6f2; font-weight: bold;">while</span> (pointer != 0 <span style="color: #8ac6f2; font-weight: bold;">and</span> compare(max_heap[parent],max_heap[pointer])) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">swap</span> = max_heap[pointer];
    max_heap[pointer] = max_heap[parent];
    max_heap[parent] = swap;

    pointer = parent;
    parent = (pointer-1)/2;
  }
}


<span style="color: #5F7F5F;">// </span><span style="color: #99968b;">compare &lt; max_heap -&gt; lesser</span>
<span style="color: #5F7F5F;">// </span><span style="color: #99968b;">compare &gt; min_heap -&gt; greater</span>
<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">pop</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&amp; <span style="color: #cae682;">max_heap</span>, <span style="color: #92a65e; font-weight: bold;">bool</span> (*<span style="color: #cae682;">compare</span>)(<span style="color: #92a65e; font-weight: bold;">int</span>,<span style="color: #92a65e; font-weight: bold;">int</span>)) {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">result</span> = max_heap[0];
  max_heap[0] = max_heap[max_heap.size()-1];
  max_heap.resize(max_heap.size()-1);
  <span style="color: #92a65e; font-weight: bold;">unsigned</span> <span style="color: #cae682;">pointer</span> = 0;
  <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">change_left</span> =
    ((<span style="color: #92a65e; font-weight: bold;">pointer</span>*2+1) &lt; max_heap.size()) <span style="color: #8ac6f2; font-weight: bold;">and</span> compare(max_heap[pointer], max_heap[pointer*2+1]);
  <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">change_right</span> =
    ((<span style="color: #92a65e; font-weight: bold;">pointer</span>*2+2) &lt; max_heap.size()) <span style="color: #8ac6f2; font-weight: bold;">and</span> compare(max_heap[pointer], max_heap[pointer*2+2]);
  
  <span style="color: #8ac6f2; font-weight: bold;">while</span> (change_left <span style="color: #8ac6f2; font-weight: bold;">or</span> change_right) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (change_left <span style="color: #8ac6f2; font-weight: bold;">and</span> change_right) {
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (compare(max_heap[pointer*2+1],max_heap[pointer*2+2]))
        change_left = <span style="color: #e5786d;">false</span>;
      <span style="color: #8ac6f2; font-weight: bold;">else</span>
        change_right = <span style="color: #e5786d;">false</span>;
    }
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (change_left) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">swap</span> = max_heap[pointer];
      max_heap[pointer] = max_heap[pointer*2+1];
      max_heap[pointer*2+1] = swap;
      pointer = pointer*2+1;
    }
    <span style="color: #8ac6f2; font-weight: bold;">else</span> <span style="color: #8ac6f2; font-weight: bold;">if</span> (change_right) {
      <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">swap</span> = max_heap[pointer];
      max_heap[pointer] = max_heap[pointer*2+2];
      max_heap[pointer*2+2] = swap;
      pointer = pointer*2+2;
    }

    change_left =
      ((<span style="color: #92a65e; font-weight: bold;">pointer</span>*2+1) &lt; max_heap.size()) <span style="color: #8ac6f2; font-weight: bold;">and</span> compare(max_heap[pointer], max_heap[pointer*2+1]);
    change_right =
      ((<span style="color: #92a65e; font-weight: bold;">pointer</span>*2+2) &lt; max_heap.size()) <span style="color: #8ac6f2; font-weight: bold;">and</span> compare(max_heap[pointer], max_heap[pointer*2+2]);
  }

  <span style="color: #8ac6f2; font-weight: bold;">return</span> result;
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  cout &lt;&lt; fixed &lt;&lt; setprecision(1);
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>; cin &gt;&gt; n;
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">max_heap</span>;
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">min_heap</span>;
  <span style="color: #92a65e; font-weight: bold;">float</span> <span style="color: #cae682;">median</span> = 0;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">diff</span> = 0;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">read</span>;

  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">First element</span>
  cin &gt;&gt; read;
  max_heap.push_back(read);
  median = read;
  diff = 1;
  cout &lt;&lt; <span style="color: #92a65e; font-weight: bold;">float</span>(median) &lt;&lt; endl;

  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">All elements</span>
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;n-1; i++) {
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Inserts new element</span>
    cin &gt;&gt; read;
    
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (read &gt;= median) {
      insert(min_heap,moret,read);
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (min_heap.size() &gt; max_heap.size())
        insert(max_heap,lesst,pop(min_heap,moret));
    }

    <span style="color: #8ac6f2; font-weight: bold;">if</span> (read &lt; median) {
      insert(max_heap,lesst,read);
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (max_heap.size() &gt; min_heap.size()+1)
        insert(min_heap,moret,pop(max_heap,lesst));
    }
    
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Recomputes median</span>
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (i%2 == 0)
      median = (max_heap[0] + min_heap[0])/2.0;
    <span style="color: #8ac6f2; font-weight: bold;">else</span>
      median = (max_heap[0]);
    cout &lt;&lt; <span style="color: #92a65e; font-weight: bold;">float</span>(median) &lt;&lt; endl;

    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">cerr &lt;&lt; "max: [";</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">for (unsigned i=0; i&lt;max_heap.size();i++)</span>
    <span style="color: #5F7F5F;">//   </span><span style="color: #99968b;">cerr &lt;&lt;max_heap[i] &lt;&lt; ",";</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">cerr &lt;&lt; "]\n";</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">cerr &lt;&lt; "min: [";</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">for (unsigned i=0; i&lt;min_heap.size();i++)</span>
    <span style="color: #5F7F5F;">//   </span><span style="color: #99968b;">cerr &lt;&lt;min_heap[i] &lt;&lt; ",";</span>
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">cerr &lt;&lt; "]\n";</span>
  }
}
</pre>
</div>
</div>
</div>
</div>
</div>

<div id="outline-container-orga0b5d0a" class="outline-3">
<h3 id="orga0b5d0a">Functional Programming</h3>
