challenges.org
**** Solve me first FP
#+BEGIN_SRC haskell
solveMeFirst a b = a + b

main = do
    val1 <- readLn
    val2 <- readLn
    let sum = solveMeFirst val1 val2
    print sum
#+END_SRC

**** Hello world
#+BEGIN_SRC haskell
hello_world = putStrLn "Hello World"
main = do
   hello_world
#+END_SRC

**** Hello world N times
#+BEGIN_SRC haskell
hello_worlds n = mapM_ putStrLn (replicate n "Hello World")
main = do
   n <- readLn :: IO Int
   hello_worlds n
#+END_SRC

**** List replication
#+BEGIN_SRC haskell
f n = concat . map (replicate n)
main = do
   n <- readLn :: IO Int
   inputdata <- getContents
   mapM_ putStrLn $ map show $ f n $ map (read :: String -> Int) $ lines inputdata
#+END_SRC
**** Filter Array
#+BEGIN_SRC haskell
f :: Int -> [Int] -> [Int]
f _ [] = [] 
f n (x:xs)
    | (x < n) = (x:(f n xs))
    | otherwise = f n xs

main = do 
    n <- readLn :: IO Int 
    inputdata <- getContents 
    let 
        numbers = map read (lines inputdata) :: [Int] 
    putStrLn . unlines $ (map show . f n) numbers
#+END_SRC
**** Filter Positions in a list
#+BEGIN_SRC haskell
f :: [Int] -> [Int]
f (x:xs) = g xs
f [] = []

g :: [Int] -> [Int]
g (x:xs) = x : (f xs)
g [] = []

main = do
   inputdata <- getContents
   mapM_ (putStrLn. show). f. map read. lines $ inputdata
#+END_SRC
**** Array of N elements
#+BEGIN_SRC haskell
fn n = [1..n]
#+END_SRC
**** Reverse a list
#+BEGIN_SRC haskell
  rev [] = []
  rev (x:xs) = (rev xs) ++ [x]

  main = do
    inputdata <- getContents
    mapM_ putStrLn $ map show $ rev $ map (read :: String -> Int) $ lines inputdata
#+END_SRC
**** Sum of Odd elements
#+BEGIN_SRC haskell
isOdd x = (mod x 2 == 1)
f = sum . (filter (isOdd))

main = do
   inputdata <- getContents
   putStrLn $ show $ f $ map (read :: String -> Int) $ lines inputdata
#+END_SRC
**** List Length
#+BEGIN_SRC haskell
  len :: [a] -> Int
  len lst = case lst of
              []     -> 0
              (x:xs) -> succ (len xs)

  main = do
    inputdata <- getContents
    putStrLn $ show $ len $ map (read :: String -> Int) $ lines inputdata
#+END_SRC
**** Update List
#+BEGIN_SRC haskell
f = map abs
main = do
   inputdata <- getContents
   mapM_ putStrLn $ map show $ f $ map (read :: String -> Int) $ lines inputdata
#+END_SRC
