docs/challenges.html
<div class="outline-text-3" id="text-orga0b5d0a">
</div><div id="outline-container-orgf337b6b" class="outline-4">
<h4 id="orgf337b6b">Introduction</h4>
<div class="outline-text-4" id="text-orgf337b6b">
</div><div id="outline-container-orgc53b8c0" class="outline-5">
<h5 id="orgc53b8c0">Solve me first FP</h5>
<div class="outline-text-5" id="text-orgc53b8c0">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">solveMeFirst</span> a b <span style="color: #cae682;">=</span> a <span style="color: #cae682;">+</span> b

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
    val1 <span style="color: #cae682;">&lt;-</span> readLn
    val2 <span style="color: #cae682;">&lt;-</span> readLn
    <span style="color: #8ac6f2; font-weight: bold;">let</span> sum <span style="color: #cae682;">=</span> solveMeFirst val1 val2
    print sum
</pre>
</div>
</div>
</div>

<div id="outline-container-orgfd3db9b" class="outline-5">
<h5 id="orgfd3db9b">Hello world</h5>
<div class="outline-text-5" id="text-orgfd3db9b">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">hello_world</span> <span style="color: #cae682;">=</span> putStrLn <span style="color: #95e454;">"Hello World"</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
   hello_world
</pre>
</div>
</div>
</div>

<div id="outline-container-orgc0bd04e" class="outline-5">
<h5 id="orgc0bd04e">Hello world N times</h5>
<div class="outline-text-5" id="text-orgc0bd04e">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">hello_worlds</span> n <span style="color: #cae682;">=</span> mapM_ putStrLn (replicate n <span style="color: #95e454;">"Hello World"</span>)
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
   n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
   hello_worlds n
</pre>
</div>
</div>
</div>

<div id="outline-container-orgceedbd7" class="outline-5">
<h5 id="orgceedbd7">List replication</h5>
<div class="outline-text-5" id="text-orgceedbd7">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">f</span> n <span style="color: #cae682;">=</span> concat <span style="color: #cae682;">.</span> map (replicate n)
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
   n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
   inputdata <span style="color: #cae682;">&lt;-</span> getContents
   mapM_ putStrLn <span style="color: #cae682;">$</span> map show <span style="color: #cae682;">$</span> f n <span style="color: #cae682;">$</span> map (read <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">$</span> lines inputdata
</pre>
</div>
</div>
</div>
<div id="outline-container-org71766d0" class="outline-5">
<h5 id="org71766d0">Filter Array</h5>
<div class="outline-text-5" id="text-org71766d0">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">f</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">f</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span> 
<span style="color: #cae682;">f</span> n (x<span style="color: #92a65e; font-weight: bold;">:</span>xs)
    <span style="color: #cae682;">|</span> (x <span style="color: #cae682;">&lt;</span> n) <span style="color: #cae682;">=</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>(f n xs))
    <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> f n xs

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span> 
    n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span> 
    inputdata <span style="color: #cae682;">&lt;-</span> getContents 
    <span style="color: #8ac6f2; font-weight: bold;">let</span> 
        numbers <span style="color: #cae682;">=</span> map read (lines inputdata) <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] 
    putStrLn <span style="color: #cae682;">.</span> unlines <span style="color: #cae682;">$</span> (map show <span style="color: #cae682;">.</span> f n) numbers
</pre>
</div>
</div>
</div>
<div id="outline-container-orgba3bfd3" class="outline-5">
<h5 id="orgba3bfd3">Filter Positions in a list</h5>
<div class="outline-text-5" id="text-orgba3bfd3">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">f</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">f</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> g xs
<span style="color: #cae682;">f</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>

<span style="color: #cae682;">g</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">g</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> x <span style="color: #92a65e; font-weight: bold;">:</span> (f xs)
<span style="color: #cae682;">g</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
   inputdata <span style="color: #cae682;">&lt;-</span> getContents
   mapM_ (putStrLn<span style="color: #cae682;">.</span> show)<span style="color: #cae682;">.</span> f<span style="color: #cae682;">.</span> map read<span style="color: #cae682;">.</span> lines <span style="color: #cae682;">$</span> inputdata
</pre>
</div>
</div>
</div>
<div id="outline-container-org4e0065c" class="outline-5">
<h5 id="org4e0065c">Array of N elements</h5>
<div class="outline-text-5" id="text-org4e0065c">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">fn</span> n <span style="color: #cae682;">=</span> [1<span style="color: #cae682;">..</span>n]
</pre>
</div>
</div>
</div>
<div id="outline-container-org961b20c" class="outline-5">
<h5 id="org961b20c">Reverse a list</h5>
<div class="outline-text-5" id="text-org961b20c">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">rev</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">rev</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> (rev xs) <span style="color: #cae682;">++</span> [x]

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  inputdata <span style="color: #cae682;">&lt;-</span> getContents
  mapM_ putStrLn <span style="color: #cae682;">$</span> map show <span style="color: #cae682;">$</span> rev <span style="color: #cae682;">$</span> map (read <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">$</span> lines inputdata
</pre>
</div>
</div>
</div>
<div id="outline-container-orge92a2c3" class="outline-5">
<h5 id="orge92a2c3">Sum of Odd elements</h5>
<div class="outline-text-5" id="text-orge92a2c3">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">isOdd</span> x <span style="color: #cae682;">=</span> (mod x 2 <span style="color: #cae682;">==</span> 1)
<span style="color: #cae682;">f</span> <span style="color: #cae682;">=</span> sum <span style="color: #cae682;">.</span> (filter (isOdd))

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
   inputdata <span style="color: #cae682;">&lt;-</span> getContents
   putStrLn <span style="color: #cae682;">$</span> show <span style="color: #cae682;">$</span> f <span style="color: #cae682;">$</span> map (read <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">$</span> lines inputdata
</pre>
</div>
</div>
</div>
<div id="outline-container-org147205c" class="outline-5">
<h5 id="org147205c">List Length</h5>
<div class="outline-text-5" id="text-org147205c">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">len</span> <span style="color: #cae682;">::</span> [a] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">len</span> lst <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">case</span> lst <span style="color: #8ac6f2; font-weight: bold;">of</span>
            <span style="color: #92a65e; font-weight: bold;">[]</span>     <span style="color: #cae682;">-&gt;</span> 0
            (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">-&gt;</span> succ (len xs)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  inputdata <span style="color: #cae682;">&lt;-</span> getContents
  putStrLn <span style="color: #cae682;">$</span> show <span style="color: #cae682;">$</span> len <span style="color: #cae682;">$</span> map (read <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">$</span> lines inputdata
</pre>
</div>
</div>
</div>
