docs/challenges.html
<div id="outline-container-orgc0c692f" class="outline-5">
<h5 id="orgc0c692f">Update List</h5>
<div class="outline-text-5" id="text-orgc0c692f">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">f</span> <span style="color: #cae682;">=</span> map abs
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
   inputdata <span style="color: #cae682;">&lt;-</span> getContents
   mapM_ putStrLn <span style="color: #cae682;">$</span> map show <span style="color: #cae682;">$</span> f <span style="color: #cae682;">$</span> map (read <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">$</span> lines inputdata
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb2e32c0" class="outline-5">
<h5 id="orgb2e32c0">Evaluating e<sup>x</sup></h5>
<div class="outline-text-5" id="text-orgb2e32c0">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Applicative</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">System.IO</span>

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
    n_temp <span style="color: #cae682;">&lt;-</span> getLine
    <span style="color: #8ac6f2; font-weight: bold;">let</span> n <span style="color: #cae682;">=</span> read n_temp <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
    forM_ [1<span style="color: #cae682;">..</span>n] <span style="color: #cae682;">$</span> <span style="color: #cae682;">\</span>a0  <span style="color: #cae682;">-&gt;</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
        x_temp <span style="color: #cae682;">&lt;-</span> getLine
        <span style="color: #8ac6f2; font-weight: bold;">let</span> x <span style="color: #cae682;">=</span> read x_temp <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Double</span>

<span style="color: #cae682;">getMultipleLines</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">IO</span> [<span style="color: #92a65e; font-weight: bold;">String</span>]
<span style="color: #cae682;">getMultipleLines</span> n
    <span style="color: #cae682;">|</span> n <span style="color: #cae682;">&lt;=</span> 0 <span style="color: #cae682;">=</span> return <span style="color: #92a65e; font-weight: bold;">[]</span>
    <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>          
        x <span style="color: #cae682;">&lt;-</span> getLine         
        xs <span style="color: #cae682;">&lt;-</span> getMultipleLines (n<span style="color: #cae682;">-</span>1)    
        <span style="color: #8ac6f2; font-weight: bold;">let</span> ret <span style="color: #cae682;">=</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs)    
        return ret
</pre>
</div>
</div>
</div>
<div id="outline-container-org27f29dc" class="outline-5">
<h5 id="org27f29dc">Functions or not?</h5>
<div class="outline-text-5" id="text-org27f29dc">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Char</span>

<span style="color: #cae682;">allDifferent</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Eq</span> a) <span style="color: #cae682;">=&gt;</span> [a] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">allDifferent</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">True</span>
<span style="color: #cae682;">allDifferent</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> (notElem x xs) <span style="color: #cae682;">&amp;&amp;</span> (allDifferent xs)

<span style="color: #cae682;">isFunction</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Eq</span> a) <span style="color: #cae682;">=&gt;</span> [(a,a)] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">isFunction</span> l <span style="color: #cae682;">=</span> allDifferent (map fst l)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  contents <span style="color: #cae682;">&lt;-</span> getContents
  <span style="color: #8ac6f2; font-weight: bold;">let</span> cases <span style="color: #cae682;">=</span> parse contents
  <span style="color: #8ac6f2; font-weight: bold;">let</span> sols <span style="color: #cae682;">=</span> map ((<span style="color: #cae682;">\</span>x <span style="color: #cae682;">-&gt;</span> <span style="color: #8ac6f2; font-weight: bold;">if</span> x <span style="color: #8ac6f2; font-weight: bold;">then</span> <span style="color: #95e454;">"YES"</span> <span style="color: #8ac6f2; font-weight: bold;">else</span> <span style="color: #95e454;">"NO"</span>) <span style="color: #cae682;">.</span> isFunction) cases
  mapM_ putStrLn sols
  
<span style="color: #cae682;">parse</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> [[(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]]
<span style="color: #cae682;">parse</span> cnt <span style="color: #cae682;">=</span> parseHead <span style="color: #cae682;">$</span> drop 1 (lines cnt)

<span style="color: #cae682;">parseHead</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">String</span>] <span style="color: #cae682;">-&gt;</span> [[(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]]
<span style="color: #cae682;">parseHead</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">parseHead</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> parseBody (take n xs) <span style="color: #92a65e; font-weight: bold;">:</span> parseHead (drop n xs)
  <span style="color: #8ac6f2; font-weight: bold;">where</span> n <span style="color: #cae682;">=</span> read x

<span style="color: #cae682;">parseBody</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">String</span>] <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]
<span style="color: #cae682;">parseBody</span> <span style="color: #cae682;">=</span> map ((<span style="color: #cae682;">\</span>[a,b] <span style="color: #cae682;">-&gt;</span> (a,b)) <span style="color: #cae682;">.</span> (map read) <span style="color: #cae682;">.</span> words)
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc17d77b" class="outline-5">
<h5 id="orgc17d77b">Compute the perimeter of a polygon</h5>
<div class="outline-text-5" id="text-orgc17d77b">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">perimeter</span> <span style="color: #cae682;">::</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #cae682;">perimeter</span> l <span style="color: #cae682;">=</span> sum <span style="color: #cae682;">$</span> map distance (pairs l)

<span style="color: #cae682;">pairs</span> <span style="color: #cae682;">::</span> [a] <span style="color: #cae682;">-&gt;</span> [(a,a)]
<span style="color: #cae682;">pairs</span> l <span style="color: #cae682;">=</span> zip l (tail l <span style="color: #cae682;">++</span> [head l])

<span style="color: #cae682;">distance</span> <span style="color: #cae682;">::</span> ((<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>),(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)) <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #cae682;">distance</span> ((x,y),(v,w)) <span style="color: #cae682;">=</span> sqrt <span style="color: #cae682;">.</span> fromIntegral <span style="color: #cae682;">$</span> (x<span style="color: #cae682;">-</span>v)<span style="color: #cae682;">^</span>2 <span style="color: #cae682;">+</span> (y<span style="color: #cae682;">-</span>w)<span style="color: #cae682;">^</span>2

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  contents <span style="color: #cae682;">&lt;-</span> getContents
  <span style="color: #8ac6f2; font-weight: bold;">let</span> points <span style="color: #cae682;">=</span> parseContents contents
  <span style="color: #8ac6f2; font-weight: bold;">let</span> perim <span style="color: #cae682;">=</span> perimeter points
  print perim

<span style="color: #cae682;">parseContents</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]
<span style="color: #cae682;">parseContents</span> str <span style="color: #cae682;">=</span> map ((<span style="color: #cae682;">\</span>[a,b] <span style="color: #cae682;">-&gt;</span> (a,b)) <span style="color: #cae682;">.</span> (map read) <span style="color: #cae682;">.</span> words) (take (read n) ns)
  <span style="color: #8ac6f2; font-weight: bold;">where</span> n<span style="color: #92a65e; font-weight: bold;">:</span>ns <span style="color: #cae682;">=</span> lines str
</pre>
</div>
</div>
</div>
