docs/challenges.html
<div id="outline-container-org036d584" class="outline-5">
<h5 id="org036d584">Compute the area of a polygon</h5>
<div class="outline-text-5" id="text-org036d584">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">area</span> <span style="color: #cae682;">::</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Float</span>
<span style="color: #cae682;">area</span> l <span style="color: #cae682;">=</span> (fromIntegral (sum <span style="color: #cae682;">$</span> map (<span style="color: #cae682;">\</span>((x,y),(v,w)) <span style="color: #cae682;">-&gt;</span> (x<span style="color: #cae682;">*</span>w<span style="color: #cae682;">-</span>y<span style="color: #cae682;">*</span>v)) (pairs l))) <span style="color: #cae682;">*</span> 0.5

<span style="color: #cae682;">pairs</span> <span style="color: #cae682;">::</span> [a] <span style="color: #cae682;">-&gt;</span> [(a,a)]
<span style="color: #cae682;">pairs</span> l <span style="color: #cae682;">=</span> zip l (tail l <span style="color: #cae682;">++</span> [head l])

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  contents <span style="color: #cae682;">&lt;-</span> getContents
  <span style="color: #8ac6f2; font-weight: bold;">let</span> points <span style="color: #cae682;">=</span> parseContents contents
  print <span style="color: #cae682;">$</span> (area points)

<span style="color: #cae682;">parseContents</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]
<span style="color: #cae682;">parseContents</span> str <span style="color: #cae682;">=</span> map ((<span style="color: #cae682;">\</span>[a,b] <span style="color: #cae682;">-&gt;</span> (a,b)) <span style="color: #cae682;">.</span> (map read) <span style="color: #cae682;">.</span> words) (take (read n) ns)
  <span style="color: #8ac6f2; font-weight: bold;">where</span> n<span style="color: #92a65e; font-weight: bold;">:</span>ns <span style="color: #cae682;">=</span> lines str
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org657f521" class="outline-4">
<h4 id="org657f521">Recursion</h4>
<div class="outline-text-4" id="text-org657f521">
</div><div id="outline-container-org3bb464f" class="outline-5">
<h5 id="org3bb464f">Computing the GCD</h5>
<div class="outline-text-5" id="text-org3bb464f">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">module</span> <span style="color: #92a65e; font-weight: bold;">Main</span> <span style="color: #8ac6f2; font-weight: bold;">where</span>

<span style="color: #cae682;">gcd'</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Integral</span> a <span style="color: #cae682;">=&gt;</span> a <span style="color: #cae682;">-&gt;</span> a <span style="color: #cae682;">-&gt;</span> a
<span style="color: #cae682;">gcd'</span> a b
    <span style="color: #cae682;">|</span> (b <span style="color: #cae682;">&lt;</span> a) <span style="color: #cae682;">=</span> gcd'' a b
    <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> gcd'' b a
    <span style="color: #8ac6f2; font-weight: bold;">where</span>
        gcd'' x 0 <span style="color: #cae682;">=</span> x
        gcd'' x y <span style="color: #cae682;">=</span> gcd'' y (rem x y)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  input <span style="color: #cae682;">&lt;-</span> getLine
  print <span style="color: #cae682;">.</span> uncurry gcd' <span style="color: #cae682;">.</span> listToTuple <span style="color: #cae682;">.</span> convertToInt <span style="color: #cae682;">.</span> words <span style="color: #cae682;">$</span> input
 <span style="color: #8ac6f2; font-weight: bold;">where</span>
  listToTuple (x<span style="color: #92a65e; font-weight: bold;">:</span>xs<span style="color: #92a65e; font-weight: bold;">:</span><span style="color: #8ac6f2; font-weight: bold;">_</span>) <span style="color: #cae682;">=</span> (x,xs)
  convertToInt <span style="color: #cae682;">=</span> map (read <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>)
</pre>
</div>
</div>
</div>
<div id="outline-container-orge026ae2" class="outline-5">
<h5 id="orge026ae2">Fibonacci numbers</h5>
<div class="outline-text-5" id="text-orge026ae2">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">module</span> <span style="color: #92a65e; font-weight: bold;">Main</span> <span style="color: #8ac6f2; font-weight: bold;">where</span>

<span style="color: #cae682;">fib</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">fib</span> n
    <span style="color: #cae682;">|</span> (n<span style="color: #cae682;">==</span>1) <span style="color: #cae682;">=</span> 0
    <span style="color: #cae682;">|</span> (n<span style="color: #cae682;">==</span>2) <span style="color: #cae682;">=</span> 1
    <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> (fib (n<span style="color: #cae682;">-</span>1)) <span style="color: #cae682;">+</span> (fib (n<span style="color: #cae682;">-</span>2))

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
    input <span style="color: #cae682;">&lt;-</span> getLine
    print <span style="color: #cae682;">.</span> fib <span style="color: #cae682;">.</span> (read <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">$</span> input
</pre>
</div>
</div>
</div>
<div id="outline-container-org4fa8b2d" class="outline-5">
<h5 id="org4fa8b2d">Pascal's triangle</h5>
<div class="outline-text-5" id="text-org4fa8b2d">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">factorial</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">factorial</span> 0 <span style="color: #cae682;">=</span> 1
<span style="color: #cae682;">factorial</span> n <span style="color: #cae682;">=</span> n <span style="color: #cae682;">*</span> (factorial (n<span style="color: #cae682;">-</span>1))

<span style="color: #cae682;">binomial</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">binomial</span> n r <span style="color: #cae682;">=</span> quot (factorial n) ((factorial r) <span style="color: #cae682;">*</span> (factorial (n<span style="color: #cae682;">-</span>r)))

<span style="color: #cae682;">pascal</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [[<span style="color: #92a65e; font-weight: bold;">Int</span>]]
<span style="color: #cae682;">pascal</span> n <span style="color: #cae682;">=</span> map pascalfile [0<span style="color: #cae682;">..</span>(n<span style="color: #cae682;">-</span>1)]
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    pascalfile m <span style="color: #cae682;">=</span> map (binomial m) [0<span style="color: #cae682;">..</span>m]

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  x <span style="color: #cae682;">&lt;-</span> getLine
  <span style="color: #8ac6f2; font-weight: bold;">let</span> n <span style="color: #cae682;">=</span> read x <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  <span style="color: #8ac6f2; font-weight: bold;">let</span> list <span style="color: #cae682;">=</span> pascal n
  mapM_ putStrLn (map (unwords <span style="color: #cae682;">.</span> (map show)) list)
  return <span style="color: #92a65e; font-weight: bold;">()</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org7aaa32b" class="outline-5">
<h5 id="org7aaa32b">String-o-Permute</h5>
<div class="outline-text-5" id="text-org7aaa32b">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

<span style="color: #cae682;">permute</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">permute</span> <span style="color: #92a65e; font-weight: bold;">[]</span>       <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">permute</span> (a<span style="color: #92a65e; font-weight: bold;">:</span>b<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> b<span style="color: #92a65e; font-weight: bold;">:</span>a<span style="color: #92a65e; font-weight: bold;">:</span>(permute xs)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn
  replicateM_ n (<span style="color: #8ac6f2; font-weight: bold;">do</span>
                    s <span style="color: #cae682;">&lt;-</span> getLine
                    putStrLn <span style="color: #cae682;">$</span> permute s
                )
</pre>
</div>
</div>
</div>
