docs/challenges.html
<div id="outline-container-org4c78a44" class="outline-5">
<h5 id="org4c78a44">String Compression</h5>
<div class="outline-text-5" id="text-org4c78a44">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">compress</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">compress</span> <span style="color: #cae682;">=</span> compressacc (0,<span style="color: #95e454;">'0'</span>)
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    compressacc <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Char</span>) <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
    compressacc (n,x) <span style="color: #92a65e; font-weight: bold;">[]</span>
      <span style="color: #cae682;">|</span> n <span style="color: #cae682;">==</span> 0    <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
      <span style="color: #cae682;">|</span> n <span style="color: #cae682;">==</span> 1    <span style="color: #cae682;">=</span> [x]
      <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> x <span style="color: #92a65e; font-weight: bold;">:</span> show n
    compressacc (n,x) (y<span style="color: #92a65e; font-weight: bold;">:</span>ys)
      <span style="color: #cae682;">|</span> x <span style="color: #cae682;">==</span> y    <span style="color: #cae682;">=</span> compressacc (succ n,x) ys
      <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> compressacc (n,x) <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">++</span> compressacc (1,y) ys
  
<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  string <span style="color: #cae682;">&lt;-</span> getLine
  putStrLn <span style="color: #cae682;">$</span> compress string
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf156b96" class="outline-5">
<h5 id="orgf156b96">Prefix Compression</h5>
<div class="outline-text-5" id="text-orgf156b96">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">compression</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">String</span>,<span style="color: #92a65e; font-weight: bold;">String</span>,<span style="color: #92a65e; font-weight: bold;">String</span>)
<span style="color: #cae682;">compression</span> <span style="color: #92a65e; font-weight: bold;">[]</span> y <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">[]</span>,<span style="color: #92a65e; font-weight: bold;">[]</span>,y)
<span style="color: #cae682;">compression</span> x <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">[]</span>,x,<span style="color: #92a65e; font-weight: bold;">[]</span>)
<span style="color: #cae682;">compression</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) (y<span style="color: #92a65e; font-weight: bold;">:</span>ys)
    <span style="color: #cae682;">|</span> x <span style="color: #cae682;">==</span> y    <span style="color: #cae682;">=</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>a,b,c) 
    <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">[]</span>,x<span style="color: #92a65e; font-weight: bold;">:</span>xs,y<span style="color: #92a65e; font-weight: bold;">:</span>ys)
  <span style="color: #8ac6f2; font-weight: bold;">where</span> (a,b,c) <span style="color: #cae682;">=</span> compression xs ys

<span style="color: #cae682;">linelen</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">linelen</span> x <span style="color: #cae682;">=</span> show (length x) <span style="color: #cae682;">++</span> <span style="color: #95e454;">" "</span> <span style="color: #cae682;">++</span> x

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span> x <span style="color: #cae682;">&lt;-</span> getLine
          y <span style="color: #cae682;">&lt;-</span> getLine
          <span style="color: #8ac6f2; font-weight: bold;">let</span> (a,b,c) <span style="color: #cae682;">=</span> compression x y
          putStrLn <span style="color: #cae682;">$</span> linelen a
          putStrLn <span style="color: #cae682;">$</span> linelen b
          putStrLn <span style="color: #cae682;">$</span> linelen c
</pre>
</div>
</div>
</div>
<div id="outline-container-org1384a06" class="outline-5">
<h5 id="org1384a06">String Reductions</h5>
<div class="outline-text-5" id="text-org1384a06">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">reduction</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Eq</span> a <span style="color: #cae682;">=&gt;</span> [a] <span style="color: #cae682;">-&gt;</span> [a]
<span style="color: #cae682;">reduction</span> <span style="color: #92a65e; font-weight: bold;">[]</span>    <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">reduction</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs)
    <span style="color: #cae682;">|</span> elem x xs <span style="color: #cae682;">=</span> reduction xs
    <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> x<span style="color: #92a65e; font-weight: bold;">:</span>(reduction xs)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span> x <span style="color: #cae682;">&lt;-</span> getLine
          putStr <span style="color: #cae682;">$</span> reverse (reduction (reverse x))
</pre>
</div>
</div>
</div>
<div id="outline-container-org1cfa829" class="outline-5">
<h5 id="org1cfa829">The Sums of Powers</h5>
<div class="outline-text-5" id="text-org1cfa829">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #cae682;">forms</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">forms</span> <span style="color: #8ac6f2; font-weight: bold;">_</span>  0 <span style="color: #cae682;">=</span> 1
<span style="color: #cae682;">forms</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #cae682;">=</span> 0
<span style="color: #cae682;">forms</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) g
  <span style="color: #cae682;">|</span> g <span style="color: #cae682;">&lt;</span> x     <span style="color: #cae682;">=</span> 0
  <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> (forms xs g) <span style="color: #cae682;">+</span> (forms xs (g<span style="color: #cae682;">-</span>x))

<span style="color: #cae682;">sumpowers</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">sumpowers</span> n e <span style="color: #cae682;">=</span> forms (map (<span style="color: #cae682;">^</span>e) [1<span style="color: #cae682;">..</span>]) n

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  e <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  putStrLn <span style="color: #cae682;">.</span> show <span style="color: #cae682;">$</span> sumpowers n e
</pre>
</div>
</div>
</div>
