docs/challenges.html
<div id="outline-container-orgc6936da" class="outline-5">
<h5 id="orgc6936da">Super-Queens on a chessboard</h5>
<div class="outline-text-5" id="text-orgc6936da">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Applicative</span> ((<span style="color: #cae682;">&lt;$&gt;</span>))
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Sequence</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> <span style="color: #92a65e; font-weight: bold;">Seq</span>

<span style="color: #cae682;">attack</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>) <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">attack</span> (xa,ya) (xb,yb)
  <span style="color: #cae682;">|</span> ((abs (xa<span style="color: #cae682;">-</span>xb) <span style="color: #cae682;">&lt;=</span> 2) <span style="color: #cae682;">&amp;&amp;</span> (abs (ya<span style="color: #cae682;">-</span>yb) <span style="color: #cae682;">&lt;=</span> 2)) <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">True</span>
  <span style="color: #cae682;">|</span> (abs (xa<span style="color: #cae682;">-</span>xb)) <span style="color: #cae682;">==</span> (abs (ya<span style="color: #cae682;">-</span>yb)) <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">True</span>
  <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">False</span>

<span style="color: #cae682;">putQueen</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Seq</span> <span style="color: #92a65e; font-weight: bold;">Bool</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">putQueen</span> n prevqueens columns row <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">if</span> n <span style="color: #cae682;">==</span> row <span style="color: #8ac6f2; font-weight: bold;">then</span> 1 <span style="color: #8ac6f2; font-weight: bold;">else</span> sum <span style="color: #cae682;">$</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  c <span style="color: #cae682;">&lt;-</span> [0<span style="color: #cae682;">..</span>(n<span style="color: #cae682;">-</span>1)]
  guard <span style="color: #cae682;">$</span> not <span style="color: #cae682;">$</span> index columns c
  guard <span style="color: #cae682;">$</span> not <span style="color: #cae682;">$</span> any (attack (row,c)) prevqueens
  return <span style="color: #cae682;">$</span> putQueen n ((row,c)<span style="color: #92a65e; font-weight: bold;">:</span>prevqueens) (update c <span style="color: #92a65e; font-weight: bold;">True</span> columns) (succ row)

<span style="color: #cae682;">queens</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">queens</span> n <span style="color: #cae682;">=</span> putQueen n <span style="color: #92a65e; font-weight: bold;">[]</span> (Seq.replicate n <span style="color: #92a65e; font-weight: bold;">False</span>) 0

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> queens <span style="color: #cae682;">&lt;$&gt;</span> readLn <span style="color: #cae682;">&gt;&gt;=</span> print
</pre>
</div>
</div>
</div>
<div id="outline-container-org814addb" class="outline-5">
<h5 id="org814addb">Sequence full of colors</h5>
<div class="outline-text-5" id="text-org814addb">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

<span style="color: #cae682;">fullcolorrec</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">fullcolorrec</span> rg yb <span style="color: #92a65e; font-weight: bold;">[]</span>       <span style="color: #cae682;">=</span> (rg <span style="color: #cae682;">==</span> 0) <span style="color: #cae682;">&amp;&amp;</span> (yb <span style="color: #cae682;">==</span> 0)
<span style="color: #cae682;">fullcolorrec</span> rg yb (<span style="color: #95e454;">'R'</span><span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> (rg <span style="color: #cae682;">&lt;</span>  1) <span style="color: #cae682;">&amp;&amp;</span> (fullcolorrec (rg<span style="color: #cae682;">+</span>1) yb xs)
<span style="color: #cae682;">fullcolorrec</span> rg yb (<span style="color: #95e454;">'G'</span><span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> (rg <span style="color: #cae682;">&gt;</span> <span style="color: #cae682;">-</span>1) <span style="color: #cae682;">&amp;&amp;</span> (fullcolorrec (rg<span style="color: #cae682;">-</span>1) yb xs)
<span style="color: #cae682;">fullcolorrec</span> rg yb (<span style="color: #95e454;">'Y'</span><span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> (yb <span style="color: #cae682;">&lt;</span>  1) <span style="color: #cae682;">&amp;&amp;</span> (fullcolorrec rg (yb<span style="color: #cae682;">+</span>1) xs)
<span style="color: #cae682;">fullcolorrec</span> rg yb (<span style="color: #95e454;">'B'</span><span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> (yb <span style="color: #cae682;">&gt;</span> <span style="color: #cae682;">-</span>1) <span style="color: #cae682;">&amp;&amp;</span> (fullcolorrec rg (yb<span style="color: #cae682;">-</span>1) xs)


<span style="color: #cae682;">fullcolor</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">fullcolor</span> <span style="color: #cae682;">=</span> fullcolorrec 0 0 

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  cases <span style="color: #cae682;">&lt;-</span> readLn
  replicateM_ cases (
    <span style="color: #8ac6f2; font-weight: bold;">do</span>
      chain <span style="color: #cae682;">&lt;-</span> getLine
      putStrLn <span style="color: #cae682;">.</span> show <span style="color: #cae682;">$</span> fullcolor chain
    )
</pre>
</div>
</div>
</div>
<div id="outline-container-orged15ce1" class="outline-5">
<h5 id="orged15ce1">Filter Elements</h5>
<div class="outline-text-5" id="text-orged15ce1">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Map</span> 
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Counter</span>
<span style="color: #8ac6f2; font-weight: bold;">type</span> <span style="color: #92a65e; font-weight: bold;">Counter</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Map</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #92a65e; font-weight: bold;">Int</span>

<span style="color: #cae682;">toCounter</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Counter</span>
<span style="color: #cae682;">toCounter</span> <span style="color: #cae682;">=</span> Prelude.foldl add empty

<span style="color: #cae682;">add</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Counter</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Counter</span>
<span style="color: #cae682;">add</span> l x <span style="color: #cae682;">=</span> insertWith (<span style="color: #cae682;">+</span>) x 1 l
  

<span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Filter</span>
<span style="color: #cae682;">filterk</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">filterk</span> l k <span style="color: #cae682;">=</span> Data.List.nub <span style="color: #cae682;">$</span> Data.List.filter ((flip elem) (keys <span style="color: #cae682;">$</span> Data.Map.filter (<span style="color: #cae682;">&gt;=</span>k) (toCounter l))) l

<span style="color: #cae682;">showFilter</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">showFilter</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #95e454;">"-1"</span>
<span style="color: #cae682;">showFilter</span> xs <span style="color: #cae682;">=</span> intercalate <span style="color: #95e454;">" "</span> <span style="color: #cae682;">$</span> Data.List.map show xs

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  cases <span style="color: #cae682;">&lt;-</span> readLn
  replicateM_ cases (
    <span style="color: #8ac6f2; font-weight: bold;">do</span>
      (n,k) <span style="color: #cae682;">&lt;-</span> fmap (<span style="color: #cae682;">\</span>[a,b] <span style="color: #cae682;">-&gt;</span> (a,b)) <span style="color: #cae682;">$</span> fmap ((Data.List.map read) <span style="color: #cae682;">.</span> words) getLine
      list <span style="color: #cae682;">&lt;-</span> fmap ((Data.List.map read) <span style="color: #cae682;">.</span> words) getLine
      <span style="color: #8ac6f2; font-weight: bold;">let</span> filteredlist <span style="color: #cae682;">=</span> filterk list k
      putStrLn <span style="color: #cae682;">$</span> showFilter filteredlist
    )
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org4d43652" class="outline-4">
<h4 id="org4d43652">Functional Structures</h4>
