challenges.org
**** Valid BST
#+BEGIN_SRC haskell
import Control.Monad

data BinTree a = Empty
               | Node a (BinTree a) (BinTree a)

insert :: (Ord a) => BinTree a -> a -> BinTree a
insert Empty x = Node x Empty Empty
insert (Node n lt rt) x
       | x > n = Node n lt (insert rt x)
       | x < n = Node n (insert lt x) rt

preorder :: BinTree a -> [a]
preorder Empty = []
preorder (Node n lt rt) = [n] ++ preorder lt ++ preorder rt

main :: IO ()
main = do cases <- readLn :: IO Int
          replicateM_ cases handleCase

handleCase :: IO ()
handleCase = do n <- readLn :: IO Int
                s <- getLine
                -- Reads tree
                let list = map read $ (words s) :: [Int]
                let tree = foldl insert Empty list
                let nlist = preorder tree
                -- Compares
                case (list == nlist) of
                  True -> putStrLn "YES"
                  False -> putStrLn "NO"
#+END_SRC
**** Lists and GCD
#+BEGIN_SRC haskell
  import Control.Monad
  import Data.List (intercalate)

  gcdlist :: [[(Int,Int)]] -> [(Int,Int)]
  gcdlist xs = foldr gcdtwo (head xs) xs

  gcdtwo :: [(Int,Int)] -> [(Int,Int)] -> [(Int,Int)]
  gcdtwo [] _  = []
  gcdtwo _  [] = []
  gcdtwo ((x,n):xs) ((y,m):ys)
    | (x == y) = (x, min n m):(gcdtwo xs ys)
    | (x <  y) = gcdtwo xs ((y,m):ys)
    | (x >  y) = gcdtwo ((x,n):xs) ys

  pairs :: [a] -> [(a,a)]
  pairs []       = []
  pairs (x:y:xs) = (x,y):(pairs xs)

  showPair :: (Show a) => (a,a) -> String
  showPair (x,y) = (show x) ++ " " ++ (show y) 

  main :: IO ()
  main = do
    cases <- readLn :: IO Int
    lists <- replicateM cases (fmap (pairs . (map read) . words) getLine)
    putStrLn $ intercalate " " $ map showPair $ gcdlist lists
#+END_SRC
