docs/challenges.html
<div class="outline-text-4" id="text-org4d43652">
</div><div id="outline-container-orga09632e" class="outline-5">
<h5 id="orga09632e">Valid BST</h5>
<div class="outline-text-5" id="text-orga09632e">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

<span style="color: #8ac6f2; font-weight: bold;">data</span> <span style="color: #92a65e; font-weight: bold;">BinTree</span> a <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Empty</span>
               <span style="color: #cae682;">|</span> <span style="color: #92a65e; font-weight: bold;">Node</span> a (<span style="color: #92a65e; font-weight: bold;">BinTree</span> a) (<span style="color: #92a65e; font-weight: bold;">BinTree</span> a)

<span style="color: #cae682;">insert</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Ord</span> a) <span style="color: #cae682;">=&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinTree</span> a <span style="color: #cae682;">-&gt;</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinTree</span> a
<span style="color: #cae682;">insert</span> <span style="color: #92a65e; font-weight: bold;">Empty</span> x <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Node</span> x <span style="color: #92a65e; font-weight: bold;">Empty</span> <span style="color: #92a65e; font-weight: bold;">Empty</span>
<span style="color: #cae682;">insert</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> n lt rt) x
       <span style="color: #cae682;">|</span> x <span style="color: #cae682;">&gt;</span> n <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Node</span> n lt (insert rt x)
       <span style="color: #cae682;">|</span> x <span style="color: #cae682;">&lt;</span> n <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Node</span> n (insert lt x) rt

<span style="color: #cae682;">preorder</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">BinTree</span> a <span style="color: #cae682;">-&gt;</span> [a]
<span style="color: #cae682;">preorder</span> <span style="color: #92a65e; font-weight: bold;">Empty</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">preorder</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> n lt rt) <span style="color: #cae682;">=</span> [n] <span style="color: #cae682;">++</span> preorder lt <span style="color: #cae682;">++</span> preorder rt

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span> cases <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
          replicateM_ cases handleCase

<span style="color: #cae682;">handleCase</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">handleCase</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span> n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
                s <span style="color: #cae682;">&lt;-</span> getLine
                <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Reads tree</span>
                <span style="color: #8ac6f2; font-weight: bold;">let</span> list <span style="color: #cae682;">=</span> map read <span style="color: #cae682;">$</span> (words s) <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
                <span style="color: #8ac6f2; font-weight: bold;">let</span> tree <span style="color: #cae682;">=</span> foldl insert <span style="color: #92a65e; font-weight: bold;">Empty</span> list
                <span style="color: #8ac6f2; font-weight: bold;">let</span> nlist <span style="color: #cae682;">=</span> preorder tree
                <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Compares</span>
                <span style="color: #8ac6f2; font-weight: bold;">case</span> (list <span style="color: #cae682;">==</span> nlist) <span style="color: #8ac6f2; font-weight: bold;">of</span>
                  <span style="color: #92a65e; font-weight: bold;">True</span> <span style="color: #cae682;">-&gt;</span> putStrLn <span style="color: #95e454;">"YES"</span>
                  <span style="color: #92a65e; font-weight: bold;">False</span> <span style="color: #cae682;">-&gt;</span> putStrLn <span style="color: #95e454;">"NO"</span>
</pre>
</div>
</div>
</div>
<div id="outline-container-org825ad99" class="outline-5">
<h5 id="org825ad99">Lists and GCD</h5>
<div class="outline-text-5" id="text-org825ad99">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span> (intercalate)

<span style="color: #cae682;">gcdlist</span> <span style="color: #cae682;">::</span> [[(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]] <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]
<span style="color: #cae682;">gcdlist</span> xs <span style="color: #cae682;">=</span> foldr gcdtwo (head xs) xs

<span style="color: #cae682;">gcdtwo</span> <span style="color: #cae682;">::</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)] <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)] <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]
<span style="color: #cae682;">gcdtwo</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #8ac6f2; font-weight: bold;">_</span>  <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">gcdtwo</span> <span style="color: #8ac6f2; font-weight: bold;">_</span>  <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">gcdtwo</span> ((x,n)<span style="color: #92a65e; font-weight: bold;">:</span>xs) ((y,m)<span style="color: #92a65e; font-weight: bold;">:</span>ys)
  <span style="color: #cae682;">|</span> (x <span style="color: #cae682;">==</span> y) <span style="color: #cae682;">=</span> (x, min n m)<span style="color: #92a65e; font-weight: bold;">:</span>(gcdtwo xs ys)
  <span style="color: #cae682;">|</span> (x <span style="color: #cae682;">&lt;</span>  y) <span style="color: #cae682;">=</span> gcdtwo xs ((y,m)<span style="color: #92a65e; font-weight: bold;">:</span>ys)
  <span style="color: #cae682;">|</span> (x <span style="color: #cae682;">&gt;</span>  y) <span style="color: #cae682;">=</span> gcdtwo ((x,n)<span style="color: #92a65e; font-weight: bold;">:</span>xs) ys

<span style="color: #cae682;">pairs</span> <span style="color: #cae682;">::</span> [a] <span style="color: #cae682;">-&gt;</span> [(a,a)]
<span style="color: #cae682;">pairs</span> <span style="color: #92a65e; font-weight: bold;">[]</span>       <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">pairs</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>y<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> (x,y)<span style="color: #92a65e; font-weight: bold;">:</span>(pairs xs)

<span style="color: #cae682;">showPair</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Show</span> a) <span style="color: #cae682;">=&gt;</span> (a,a) <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">showPair</span> (x,y) <span style="color: #cae682;">=</span> (show x) <span style="color: #cae682;">++</span> <span style="color: #95e454;">" "</span> <span style="color: #cae682;">++</span> (show y) 

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  cases <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  lists <span style="color: #cae682;">&lt;-</span> replicateM cases (fmap (pairs <span style="color: #cae682;">.</span> (map read) <span style="color: #cae682;">.</span> words) getLine)
  putStrLn <span style="color: #cae682;">$</span> intercalate <span style="color: #95e454;">" "</span> <span style="color: #cae682;">$</span> map showPair <span style="color: #cae682;">$</span> gcdlist lists
</pre>
</div>
</div>
</div>
