docs/challenges.html
<div id="outline-container-org76ae9f7" class="outline-5">
<h5 id="org76ae9f7">Tree Manager</h5>
<div class="outline-text-5" id="text-org76ae9f7">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad.Writer</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Sequence</span> (<span style="color: #92a65e; font-weight: bold;">Seq</span>, singleton)
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Foldable</span> (sequence_)

<span style="color: #8ac6f2; font-weight: bold;">data</span> <span style="color: #92a65e; font-weight: bold;">Tree</span> a <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Node</span> a [<span style="color: #92a65e; font-weight: bold;">Tree</span> a]
<span style="color: #8ac6f2; font-weight: bold;">data</span> <span style="color: #92a65e; font-weight: bold;">Trail</span> a <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Trail</span> (a, [<span style="color: #92a65e; font-weight: bold;">Tree</span> a], [<span style="color: #92a65e; font-weight: bold;">Tree</span> a])
<span style="color: #8ac6f2; font-weight: bold;">type</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Tree</span> a, [<span style="color: #92a65e; font-weight: bold;">Trail</span> a])

<span style="color: #cae682;">change</span> <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">change</span> x (<span style="color: #92a65e; font-weight: bold;">Node</span> y xs, t) <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> x xs, t)

<span style="color: #cae682;">get</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> a
<span style="color: #cae682;">get</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> x xs, t) <span style="color: #cae682;">=</span> x

<span style="color: #cae682;">visitLeft</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">visitLeft</span> (t, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, l<span style="color: #92a65e; font-weight: bold;">:</span>ls, rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts) <span style="color: #cae682;">=</span> (l, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, ls, t<span style="color: #92a65e; font-weight: bold;">:</span>rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts)

<span style="color: #cae682;">visitRight</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">visitRight</span> (t, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, ls, r<span style="color: #92a65e; font-weight: bold;">:</span>rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts) <span style="color: #cae682;">=</span> (r, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, t<span style="color: #92a65e; font-weight: bold;">:</span>ls, rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts)

<span style="color: #cae682;">visitParent</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">visitParent</span> (t, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, ls, rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts) <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> p ((reverse ls) <span style="color: #cae682;">++</span> [t] <span style="color: #cae682;">++</span> rs), ts)

<span style="color: #cae682;">visitChild</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">visitChild</span> n (<span style="color: #92a65e; font-weight: bold;">Node</span> y (x<span style="color: #92a65e; font-weight: bold;">:</span>xs), p) <span style="color: #cae682;">=</span> rightntimes (x, (<span style="color: #92a65e; font-weight: bold;">Trail</span> (y, <span style="color: #92a65e; font-weight: bold;">[]</span>, xs))<span style="color: #92a65e; font-weight: bold;">:</span>p)
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    rightntimes <span style="color: #cae682;">=</span> (foldr (<span style="color: #cae682;">.</span>) id (replicate (n<span style="color: #cae682;">-</span>1) visitRight))

<span style="color: #cae682;">insertLeft</span> <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">insertLeft</span>  l (t, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, ls, rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts) <span style="color: #cae682;">=</span> (t, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, (<span style="color: #92a65e; font-weight: bold;">Node</span> l <span style="color: #92a65e; font-weight: bold;">[]</span>)<span style="color: #92a65e; font-weight: bold;">:</span>ls, rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts)

<span style="color: #cae682;">insertRight</span> <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">insertRight</span> r (t, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, ls, rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts) <span style="color: #cae682;">=</span> (t, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, ls, (<span style="color: #92a65e; font-weight: bold;">Node</span> r <span style="color: #92a65e; font-weight: bold;">[]</span>)<span style="color: #92a65e; font-weight: bold;">:</span>rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts)

<span style="color: #cae682;">insertChild</span> <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">insertChild</span> c (<span style="color: #92a65e; font-weight: bold;">Node</span> x xs, ts) <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> x ((<span style="color: #92a65e; font-weight: bold;">Node</span> c <span style="color: #92a65e; font-weight: bold;">[]</span>)<span style="color: #92a65e; font-weight: bold;">:</span>xs), ts)

<span style="color: #cae682;">delete</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a
<span style="color: #cae682;">delete</span> (<span style="color: #8ac6f2; font-weight: bold;">_</span>, <span style="color: #92a65e; font-weight: bold;">Trail</span> (p, ls, rs) <span style="color: #92a65e; font-weight: bold;">:</span> ts) <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> p ((reverse ls) <span style="color: #cae682;">++</span> rs), ts)

<span style="color: #cae682;">printTree</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Show</span> a) <span style="color: #cae682;">=&gt;</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Writer</span> (<span style="color: #92a65e; font-weight: bold;">Seq</span> <span style="color: #92a65e; font-weight: bold;">String</span>) (<span style="color: #92a65e; font-weight: bold;">ZipTree</span> a)
<span style="color: #cae682;">printTree</span> zt<span style="color: #cae682;">@</span>(<span style="color: #92a65e; font-weight: bold;">Node</span> x <span style="color: #8ac6f2; font-weight: bold;">_</span>,<span style="color: #8ac6f2; font-weight: bold;">_</span>) <span style="color: #cae682;">=</span> writer (zt, singleton (show x))

<span style="color: #cae682;">readOperation</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Read</span> a, <span style="color: #92a65e; font-weight: bold;">Show</span> a) <span style="color: #cae682;">=&gt;</span> [<span style="color: #92a65e; font-weight: bold;">String</span>] <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">ZipTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Writer</span> (<span style="color: #92a65e; font-weight: bold;">Seq</span> <span style="color: #92a65e; font-weight: bold;">String</span>) (<span style="color: #92a65e; font-weight: bold;">ZipTree</span> a))
<span style="color: #cae682;">readOperation</span> s <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">case</span> s <span style="color: #8ac6f2; font-weight: bold;">of</span>
  [<span style="color: #95e454;">"change"</span>, x]         <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> change (read x)
  [<span style="color: #95e454;">"print"</span>]             <span style="color: #cae682;">-&gt;</span> printTree
  [<span style="color: #95e454;">"visit"</span>,<span style="color: #95e454;">"left"</span>]      <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> visitLeft
  [<span style="color: #95e454;">"visit"</span>,<span style="color: #95e454;">"right"</span>]     <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> visitRight
  [<span style="color: #95e454;">"visit"</span>,<span style="color: #95e454;">"parent"</span>]    <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> visitParent
  [<span style="color: #95e454;">"visit"</span>,<span style="color: #95e454;">"child"</span>, n]  <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> visitChild (read n)
  [<span style="color: #95e454;">"insert"</span>,<span style="color: #95e454;">"left"</span>, x]  <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> insertLeft (read x)
  [<span style="color: #95e454;">"insert"</span>,<span style="color: #95e454;">"right"</span>, x] <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> insertRight (read x)
  [<span style="color: #95e454;">"insert"</span>,<span style="color: #95e454;">"child"</span>, x] <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> insertChild (read x)
  [<span style="color: #95e454;">"delete"</span>]            <span style="color: #cae682;">-&gt;</span> fmap return <span style="color: #cae682;">$</span> delete
  <span style="color: #8ac6f2; font-weight: bold;">_</span>                     <span style="color: #cae682;">-&gt;</span> error <span style="color: #95e454;">"Invalid expression"</span>

<span style="color: #cae682;">startTree</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">ZipTree</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">startTree</span> <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> 0 <span style="color: #92a65e; font-weight: bold;">[]</span>, <span style="color: #92a65e; font-weight: bold;">[]</span>)


<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  operations <span style="color: #cae682;">&lt;-</span> replicateM n (fmap (readOperation <span style="color: #cae682;">.</span> words) getLine)
  <span style="color: #8ac6f2; font-weight: bold;">let</span> (a,w) <span style="color: #cae682;">=</span> runWriter <span style="color: #cae682;">$</span> foldl (<span style="color: #cae682;">&gt;&gt;=</span>) (return startTree) operations
  Data.Foldable.sequence_ <span style="color: #cae682;">$</span> fmap putStrLn w
</pre>
</div>
</div>
</div>
