docs/challenges.html
<div id="outline-container-orga7770d7" class="outline-5">
<h5 id="orga7770d7">Fighting Armies</h5>
<div class="outline-text-5" id="text-orga7770d7">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Sequence</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> <span style="color: #92a65e; font-weight: bold;">Seq</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Foldable</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Vector.Mutable</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> <span style="color: #92a65e; font-weight: bold;">Vect</span> (replicate,unsafeRead,unsafeWrite,modify,unsafeModify,<span style="color: #92a65e; font-weight: bold;">MVector</span>)
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad.Primitive</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #8ac6f2; font-weight: bold;">qualified</span> <span style="color: #92a65e; font-weight: bold;">Data.ByteString.Lazy.Char8</span> <span style="color: #8ac6f2; font-weight: bold;">as</span> <span style="color: #92a65e; font-weight: bold;">DB</span>

<span style="color: #8ac6f2; font-weight: bold;">data</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Nil</span> <span style="color: #cae682;">|</span> <span style="color: #92a65e; font-weight: bold;">Node</span> a (<span style="color: #92a65e; font-weight: bold;">Seq</span> (<span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a))
  <span style="color: #8ac6f2; font-weight: bold;">deriving</span> (<span style="color: #92a65e; font-weight: bold;">Show</span>)
<span style="color: #8ac6f2; font-weight: bold;">type</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a <span style="color: #cae682;">=</span> [<span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a]

<span style="color: #cae682;">singleton</span> <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a
<span style="color: #cae682;">singleton</span> x <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Node</span> x empty

<span style="color: #cae682;">singleHeap</span> <span style="color: #cae682;">::</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a
<span style="color: #cae682;">singleHeap</span> x <span style="color: #cae682;">=</span> [Main.singleton x]

<span style="color: #cae682;">sumTree</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Ord</span> a) <span style="color: #cae682;">=&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a, <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a)
<span style="color: #cae682;">sumTree</span> x   <span style="color: #92a65e; font-weight: bold;">Nil</span> <span style="color: #cae682;">=</span> (x,<span style="color: #92a65e; font-weight: bold;">Nil</span>)
<span style="color: #cae682;">sumTree</span> <span style="color: #92a65e; font-weight: bold;">Nil</span> y   <span style="color: #cae682;">=</span> (y,<span style="color: #92a65e; font-weight: bold;">Nil</span>)
<span style="color: #cae682;">sumTree</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> x xs) (<span style="color: #92a65e; font-weight: bold;">Node</span> y ys)
  <span style="color: #cae682;">|</span> x <span style="color: #cae682;">&gt;=</span> y    <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Nil</span>,<span style="color: #92a65e; font-weight: bold;">Node</span> x (xs <span style="color: #cae682;">|&gt;</span> <span style="color: #92a65e; font-weight: bold;">Node</span> y ys))
  <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Nil</span>,<span style="color: #92a65e; font-weight: bold;">Node</span> y (ys <span style="color: #cae682;">|&gt;</span> <span style="color: #92a65e; font-weight: bold;">Node</span> x xs))

<span style="color: #cae682;">sumTrees</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Ord</span> a) <span style="color: #cae682;">=&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a
         <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a
         <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a
         <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a, <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a)
<span style="color: #cae682;">sumTrees</span> t x <span style="color: #92a65e; font-weight: bold;">Nil</span> <span style="color: #cae682;">=</span> sumTree t x
<span style="color: #cae682;">sumTrees</span> t <span style="color: #92a65e; font-weight: bold;">Nil</span> y <span style="color: #cae682;">=</span> sumTree t y
<span style="color: #cae682;">sumTrees</span> <span style="color: #92a65e; font-weight: bold;">Nil</span> x y <span style="color: #cae682;">=</span> sumTree x y
<span style="color: #cae682;">sumTrees</span> t x y   <span style="color: #cae682;">=</span> (txy,rr)
  <span style="color: #8ac6f2; font-weight: bold;">where</span> (xy,r)   <span style="color: #cae682;">=</span> sumTree x y
        (txy,rt) <span style="color: #cae682;">=</span> sumTree xy t
        (rr,<span style="color: #8ac6f2; font-weight: bold;">_</span>)   <span style="color: #cae682;">=</span> sumTree r rt

<span style="color: #cae682;">sumHeaps</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Ord</span> a) <span style="color: #cae682;">=&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialTree</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a
<span style="color: #cae682;">sumHeaps</span> <span style="color: #92a65e; font-weight: bold;">Nil</span> <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #92a65e; font-weight: bold;">[]</span>     <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">sumHeaps</span> <span style="color: #92a65e; font-weight: bold;">Nil</span> [x] (<span style="color: #92a65e; font-weight: bold;">Nil:</span>ys) <span style="color: #cae682;">=</span> x<span style="color: #92a65e; font-weight: bold;">:</span>ys
<span style="color: #cae682;">sumHeaps</span> <span style="color: #92a65e; font-weight: bold;">Nil</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #92a65e; font-weight: bold;">[]</span> <span style="color: #cae682;">=</span> x<span style="color: #92a65e; font-weight: bold;">:</span>xs
<span style="color: #cae682;">sumHeaps</span> <span style="color: #92a65e; font-weight: bold;">Nil</span> <span style="color: #92a65e; font-weight: bold;">[]</span> (y<span style="color: #92a65e; font-weight: bold;">:</span>ys) <span style="color: #cae682;">=</span> y<span style="color: #92a65e; font-weight: bold;">:</span>ys
<span style="color: #cae682;">sumHeaps</span> t <span style="color: #92a65e; font-weight: bold;">[]</span>     <span style="color: #92a65e; font-weight: bold;">[]</span>     <span style="color: #cae682;">=</span> [t]
<span style="color: #cae682;">sumHeaps</span> t (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #92a65e; font-weight: bold;">[]</span>     <span style="color: #cae682;">=</span> tx<span style="color: #92a65e; font-weight: bold;">:</span>sumHeaps r xs <span style="color: #92a65e; font-weight: bold;">[]</span>
  <span style="color: #8ac6f2; font-weight: bold;">where</span> (tx, r) <span style="color: #cae682;">=</span> sumTree t x
<span style="color: #cae682;">sumHeaps</span> t <span style="color: #92a65e; font-weight: bold;">[]</span>     (y<span style="color: #92a65e; font-weight: bold;">:</span>ys) <span style="color: #cae682;">=</span> ty<span style="color: #92a65e; font-weight: bold;">:</span>sumHeaps r <span style="color: #92a65e; font-weight: bold;">[]</span> ys
  <span style="color: #8ac6f2; font-weight: bold;">where</span> (ty, r) <span style="color: #cae682;">=</span> sumTree t y
<span style="color: #cae682;">sumHeaps</span> t (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) (y<span style="color: #92a65e; font-weight: bold;">:</span>ys) <span style="color: #cae682;">=</span> txy<span style="color: #92a65e; font-weight: bold;">:</span>sumHeaps r xs ys
  <span style="color: #8ac6f2; font-weight: bold;">where</span> (txy, r) <span style="color: #cae682;">=</span> sumTrees t x y




<span style="color: #cae682;">merge</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Ord</span> a) <span style="color: #cae682;">=&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a
<span style="color: #cae682;">merge</span> <span style="color: #cae682;">=</span> sumHeaps <span style="color: #92a65e; font-weight: bold;">Nil</span>

<span style="color: #cae682;">insert</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Ord</span> a) <span style="color: #cae682;">=&gt;</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a
<span style="color: #cae682;">insert</span> x <span style="color: #cae682;">=</span> merge (singleHeap x)

<span style="color: #cae682;">findMin</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">findMin</span> h <span style="color: #cae682;">=</span> Prelude.foldr max 0 <span style="color: #cae682;">$</span> fs h
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    fs <span style="color: #92a65e; font-weight: bold;">[]</span>            <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
    fs (<span style="color: #92a65e; font-weight: bold;">Nil:</span>xs)      <span style="color: #cae682;">=</span> fs xs
    fs (<span style="color: #92a65e; font-weight: bold;">Node</span> x <span style="color: #8ac6f2; font-weight: bold;">_</span><span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> x<span style="color: #92a65e; font-weight: bold;">:</span>fs xs

<span style="color: #cae682;">deleteMinTree</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Ord</span> a) <span style="color: #cae682;">=&gt;</span> a <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a, <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> a)
<span style="color: #cae682;">deleteMinTree</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #92a65e; font-weight: bold;">[]</span>               <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">[]</span>,<span style="color: #92a65e; font-weight: bold;">[]</span>)
<span style="color: #cae682;">deleteMinTree</span> m (<span style="color: #92a65e; font-weight: bold;">Nil:</span>xs)         <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Nil:</span>fst (deleteMinTree m xs),snd <span style="color: #cae682;">$</span> deleteMinTree m xs)
<span style="color: #cae682;">deleteMinTree</span> m (<span style="color: #92a65e; font-weight: bold;">Node</span> x ts<span style="color: #92a65e; font-weight: bold;">:</span>xs)
  <span style="color: #cae682;">|</span> x <span style="color: #cae682;">==</span> m    <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Nil:</span>fst (deleteMinTree m xs), toList ts)
  <span style="color: #cae682;">|</span> otherwise <span style="color: #cae682;">=</span> (<span style="color: #92a65e; font-weight: bold;">Node</span> x ts<span style="color: #92a65e; font-weight: bold;">:</span>fst (deleteMinTree m xs), snd <span style="color: #cae682;">$</span> deleteMinTree m xs)

<span style="color: #cae682;">deleteMin</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">BinomialHeap</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">deleteMin</span> h <span style="color: #cae682;">=</span> merge hm mint
  <span style="color: #8ac6f2; font-weight: bold;">where</span> (hm, mint) <span style="color: #cae682;">=</span> deleteMinTree (findMin h) h




<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  [narmies, <span style="color: #8ac6f2; font-weight: bold;">_</span>] <span style="color: #cae682;">&lt;-</span> fmap (map read <span style="color: #cae682;">.</span> words) getLine <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
  army <span style="color: #cae682;">&lt;-</span> Vect.replicate (succ narmies) <span style="color: #92a65e; font-weight: bold;">[]</span>
  contents <span style="color: #cae682;">&lt;-</span> fmap DB.lines DB.getContents
  Control.Monad.forM_ contents (<span style="color: #cae682;">\</span>line <span style="color: #cae682;">-&gt;</span>
    <span style="color: #8ac6f2; font-weight: bold;">do</span>
      <span style="color: #8ac6f2; font-weight: bold;">let</span> order <span style="color: #cae682;">=</span> map readbs <span style="color: #cae682;">.</span> DB.words <span style="color: #cae682;">$</span> line
      <span style="color: #8ac6f2; font-weight: bold;">case</span> order <span style="color: #8ac6f2; font-weight: bold;">of</span>
        [1,i] <span style="color: #cae682;">-&gt;</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
          arm <span style="color: #cae682;">&lt;-</span> Vect.unsafeRead army i
          print <span style="color: #cae682;">$</span> findMin arm
        [2,i] <span style="color: #cae682;">-&gt;</span>
          Vect.unsafeModify army deleteMin i
        [3,i,c] <span style="color: #cae682;">-&gt;</span>
          Vect.unsafeModify army (insert c) i
        [4,i,j] <span style="color: #cae682;">-&gt;</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
          armj <span style="color: #cae682;">&lt;-</span> Vect.unsafeRead army j
          Vect.unsafeModify army (merge armj) i
    )
  return <span style="color: #92a65e; font-weight: bold;">()</span>

<span style="color: #cae682;">readbs</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">DB.ByteString</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">readbs</span> n <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">case</span> DB.readInt n <span style="color: #8ac6f2; font-weight: bold;">of</span>
  <span style="color: #92a65e; font-weight: bold;">Nothing</span> <span style="color: #cae682;">-&gt;</span> undefined
  <span style="color: #92a65e; font-weight: bold;">Just</span> (m,<span style="color: #8ac6f2; font-weight: bold;">_</span>) <span style="color: #cae682;">-&gt;</span> m
</pre>
</div>
</div>
</div>
</div>
