challenges.org
*** Memoization and DP
**** Number of Binary Search Tree
#+BEGIN_SRC haskell
import Control.Monad

(*.),(+.) :: Int -> Int -> Int
(*.) = (\a b -> (a*b) `mod` 100000007)
(+.) = (\a b -> (a+b) `mod` 100000007)

bin :: [Int]
bin = 1 : do
  n <- [1..]
  return $ foldr (+.) 0 $ do
    c <- [0..(n-1)]
    return $ (bin !! c) *. (bin !! (n-1-c))

main :: IO ()
main = do
  cases <- readLn :: IO Int
  replicateM_ cases (
    do
      n <- readLn
      print $ bin !! n
    )
#+END_SRC
**** Pentagonal Numbers
#+BEGIN_SRC haskell
import Control.Monad

pentagonals = 0 : zipWith (+) pentagonals (map ((+1) . (*3)) [0..])
pentagonal n = quot (n*(3*n-1)) 2

main = do
  n <- readLn
  replicateM_ n (
    do
      m <- readLn
      print $ pentagonal m
    )
#+END_SRC
**** Fibonacci
#+BEGIN_SRC haskell
import Control.Monad

modulo = 100000000 + 7
(+.) = \x -> \y -> mod (x+y) modulo
fibonacci = [0,1] ++ (zipWith (+.) fibonacci (tail fibonacci))
fib = (fibonacci !!)

main = do
  cases <- readLn
  replicateM_ cases (do
                        n <- readLn
                        print $ fib n
                    )
#+END_SRC
**** Expressions
#+BEGIN_SRC haskell
import Control.Monad
import Data.Sequence (Seq,singleton)
import Data.Foldable (toList)
import Data.Monoid

(+.) a b = mod (a+b) 101
(*.) a b = mod (a*b) 101
(-.) a b = mod (a-b) 101

operation :: (Int,Seq String) -> Int -> [(Int,Seq String)]
operation (n,s) x = [ (n *. x,mappend s $ singleton ("*"++show x)),
                      (n -. x,mappend s $ singleton ("-"++show x)),
                      (n +. x,mappend s $ singleton ("+"++show x))
                    ]

solution :: [Int] -> String
solution (x:xs) = concat . toList $
  snd . head $ filter ((==0) . fst) $ foldM operation (x,singleton (show x)) xs

main :: IO ()
main = do
  n <- readLn :: (IO Int)
  nms <- fmap ((fmap read) . words) getLine :: (IO [Int])
  putStrLn $ solution nms
#+END_SRC
*** Ad Hoc
**** Jumping Bunnies
#+BEGIN_SRC haskell
import Control.Monad

jumps :: (Integral a) => [a] -> a
jumps = foldr lcm 1

main :: IO ()
main = do
  n <- readLn :: IO Int
  bunnies <- (fmap ((map read) . words) getLine) :: IO [Int]
  print $ jumps bunnies
#+END_SRC
