docs/challenges.html
<div id="outline-container-org98e971d" class="outline-4">
<h4 id="org98e971d">Memoization and DP</h4>
<div class="outline-text-4" id="text-org98e971d">
</div><div id="outline-container-orgad56596" class="outline-5">
<h5 id="orgad56596">Number of Binary Search Tree</h5>
<div class="outline-text-5" id="text-orgad56596">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

(<span style="color: #cae682;">*.</span>),(<span style="color: #cae682;">+.</span>) <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
(<span style="color: #cae682;">*.</span>) <span style="color: #cae682;">=</span> (<span style="color: #cae682;">\</span>a b <span style="color: #cae682;">-&gt;</span> (a<span style="color: #cae682;">*</span>b) <span style="color: #cae682;">`mod`</span> 100000007)
(<span style="color: #cae682;">+.</span>) <span style="color: #cae682;">=</span> (<span style="color: #cae682;">\</span>a b <span style="color: #cae682;">-&gt;</span> (a<span style="color: #cae682;">+</span>b) <span style="color: #cae682;">`mod`</span> 100000007)

<span style="color: #cae682;">bin</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">bin</span> <span style="color: #cae682;">=</span> 1 <span style="color: #92a65e; font-weight: bold;">:</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> [1<span style="color: #cae682;">..</span>]
  return <span style="color: #cae682;">$</span> foldr (<span style="color: #cae682;">+.</span>) 0 <span style="color: #cae682;">$</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
    c <span style="color: #cae682;">&lt;-</span> [0<span style="color: #cae682;">..</span>(n<span style="color: #cae682;">-</span>1)]
    return <span style="color: #cae682;">$</span> (bin <span style="color: #cae682;">!!</span> c) <span style="color: #cae682;">*.</span> (bin <span style="color: #cae682;">!!</span> (n<span style="color: #cae682;">-</span>1<span style="color: #cae682;">-</span>c))

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  cases <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  replicateM_ cases (
    <span style="color: #8ac6f2; font-weight: bold;">do</span>
      n <span style="color: #cae682;">&lt;-</span> readLn
      print <span style="color: #cae682;">$</span> bin <span style="color: #cae682;">!!</span> n
    )
</pre>
</div>
</div>
</div>
<div id="outline-container-orge7f9c49" class="outline-5">
<h5 id="orge7f9c49">Pentagonal Numbers</h5>
<div class="outline-text-5" id="text-orge7f9c49">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

<span style="color: #cae682;">pentagonals</span> <span style="color: #cae682;">=</span> 0 <span style="color: #92a65e; font-weight: bold;">:</span> zipWith (<span style="color: #cae682;">+</span>) pentagonals (map ((<span style="color: #cae682;">+</span>1) <span style="color: #cae682;">.</span> (<span style="color: #cae682;">*</span>3)) [0<span style="color: #cae682;">..</span>])
<span style="color: #cae682;">pentagonal</span> n <span style="color: #cae682;">=</span> quot (n<span style="color: #cae682;">*</span>(3<span style="color: #cae682;">*</span>n<span style="color: #cae682;">-</span>1)) 2

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn
  replicateM_ n (
    <span style="color: #8ac6f2; font-weight: bold;">do</span>
      m <span style="color: #cae682;">&lt;-</span> readLn
      print <span style="color: #cae682;">$</span> pentagonal m
    )
</pre>
</div>
</div>
</div>
<div id="outline-container-org5f64768" class="outline-5">
<h5 id="org5f64768">Fibonacci</h5>
<div class="outline-text-5" id="text-org5f64768">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

<span style="color: #cae682;">modulo</span> <span style="color: #cae682;">=</span> 100000000 <span style="color: #cae682;">+</span> 7
(<span style="color: #cae682;">+.</span>) <span style="color: #cae682;">=</span> <span style="color: #cae682;">\</span>x <span style="color: #cae682;">-&gt;</span> <span style="color: #cae682;">\</span>y <span style="color: #cae682;">-&gt;</span> mod (x<span style="color: #cae682;">+</span>y) modulo
<span style="color: #cae682;">fibonacci</span> <span style="color: #cae682;">=</span> [0,1] <span style="color: #cae682;">++</span> (zipWith (<span style="color: #cae682;">+.</span>) fibonacci (tail fibonacci))
<span style="color: #cae682;">fib</span> <span style="color: #cae682;">=</span> (fibonacci <span style="color: #cae682;">!!</span>)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  cases <span style="color: #cae682;">&lt;-</span> readLn
  replicateM_ cases (<span style="color: #8ac6f2; font-weight: bold;">do</span>
                        n <span style="color: #cae682;">&lt;-</span> readLn
                        print <span style="color: #cae682;">$</span> fib n
                    )
</pre>
</div>
</div>
</div>
<div id="outline-container-org1238f95" class="outline-5">
<h5 id="org1238f95">Expressions</h5>
<div class="outline-text-5" id="text-org1238f95">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Sequence</span> (<span style="color: #92a65e; font-weight: bold;">Seq</span>,singleton)
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Foldable</span> (toList)
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Monoid</span>

(<span style="color: #cae682;">+.</span>) a b <span style="color: #cae682;">=</span> mod (a<span style="color: #cae682;">+</span>b) 101
(<span style="color: #cae682;">*.</span>) a b <span style="color: #cae682;">=</span> mod (a<span style="color: #cae682;">*</span>b) 101
(<span style="color: #cae682;">-.</span>) a b <span style="color: #cae682;">=</span> mod (a<span style="color: #cae682;">-</span>b) 101

<span style="color: #cae682;">operation</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Seq</span> <span style="color: #92a65e; font-weight: bold;">String</span>) <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Seq</span> <span style="color: #92a65e; font-weight: bold;">String</span>)]
<span style="color: #cae682;">operation</span> (n,s) x <span style="color: #cae682;">=</span> [ (n <span style="color: #cae682;">*.</span> x,mappend s <span style="color: #cae682;">$</span> singleton (<span style="color: #95e454;">"*"</span><span style="color: #cae682;">++</span>show x)),
                      (n <span style="color: #cae682;">-.</span> x,mappend s <span style="color: #cae682;">$</span> singleton (<span style="color: #95e454;">"-"</span><span style="color: #cae682;">++</span>show x)),
                      (n <span style="color: #cae682;">+.</span> x,mappend s <span style="color: #cae682;">$</span> singleton (<span style="color: #95e454;">"+"</span><span style="color: #cae682;">++</span>show x))
                    ]

<span style="color: #cae682;">solution</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">solution</span> (x<span style="color: #92a65e; font-weight: bold;">:</span>xs) <span style="color: #cae682;">=</span> concat <span style="color: #cae682;">.</span> toList <span style="color: #cae682;">$</span>
  snd <span style="color: #cae682;">.</span> head <span style="color: #cae682;">$</span> filter ((<span style="color: #cae682;">==</span>0) <span style="color: #cae682;">.</span> fst) <span style="color: #cae682;">$</span> foldM operation (x,singleton (show x)) xs

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>)
  nms <span style="color: #cae682;">&lt;-</span> fmap ((fmap read) <span style="color: #cae682;">.</span> words) getLine <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">IO</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>])
  putStrLn <span style="color: #cae682;">$</span> solution nms
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org38247a4" class="outline-4">
<h4 id="org38247a4">Ad Hoc</h4>
<div class="outline-text-4" id="text-org38247a4">
</div><div id="outline-container-org5512849" class="outline-5">
<h5 id="org5512849">Jumping Bunnies</h5>
<div class="outline-text-5" id="text-org5512849">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>

<span style="color: #cae682;">jumps</span> <span style="color: #cae682;">::</span> (<span style="color: #92a65e; font-weight: bold;">Integral</span> a) <span style="color: #cae682;">=&gt;</span> [a] <span style="color: #cae682;">-&gt;</span> a
<span style="color: #cae682;">jumps</span> <span style="color: #cae682;">=</span> foldr lcm 1

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  bunnies <span style="color: #cae682;">&lt;-</span> (fmap ((map read) <span style="color: #cae682;">.</span> words) getLine) <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
  print <span style="color: #cae682;">$</span> jumps bunnies
</pre>
</div>
</div>
</div>
