challenges.org
**** Rotate String
#+BEGIN_SRC haskell
import Data.List

rotations :: String -> [String]
rotations s = tail $ zipWith (++) (tails s) (inits s)

main = do
  strings <- input
  let output = map ((intercalate " ") . rotations) strings
  mapM_ putStrLn output
  
input :: IO [String]
input = do
  n <- readLn :: IO Int
  sequence $ map (\i -> getLine) [1..n]
#+END_SRC
**** Remove Duplicates
#+BEGIN_SRC haskell
import Data.Char
import Data.Bits

type Bit32 = Int

indexChar :: Char -> Int
indexChar c = (ord c) - (ord 'a')

isChar :: Bit32 -> Char -> Bool
isChar a c = testBit a (indexChar c)

setChar :: Bit32 -> Char -> Bit32
setChar a c = setBit a (indexChar c)


duplicates :: String -> String
duplicates xs = duplicates' 0 xs

duplicates' :: Bit32 -> String -> String
duplicates' _ []     = []
duplicates' b (x:xs)
  | (isChar b x)  = duplicates' b xs
  | otherwise     = x : (duplicates' (setChar b x) xs)

main = do
  string <- getLine
  putStrLn (duplicates string)
#+END_SRC
**** Huge GCD
#+BEGIN_SRC haskell
(*.) a b = mod (a*b) 1000000007

hugegcd :: [Int] -> [Int] -> Int
hugegcd as bs = fst $ foldr gcdr (1,bs) as
  where
    gcdr :: Int -> (Int,[Int]) -> (Int,[Int])
    gcdr a (g,br) = (g *. ng, nbr)
      where
        (ng,nbr) = gcda a br

gcda :: Int -> [Int] -> (Int,[Int])
gcda a []     = (1,[])
gcda a (b:bs) = (d *. g, (quot b d):ls)
  where
    d      = gcd a b
    (g,ls) = gcda (quot a d) bs


main = do
  a <- readLn :: IO Int
  lista <- fmap ((map read) . words) getLine
  b <- readLn :: IO Int
  listb <- fmap ((map read) . words) getLine
  putStrLn . show $ hugegcd lista listb
#+END_SRC
**** Missing Numbers (FP)
#+BEGIN_SRC haskell
import Prelude hiding (replicate, zipWith)
import Data.List hiding (replicate, zipWith)
import Data.Sequence

counter :: [Int] -> Seq Int
counter = foldr (adjust (+1)) (replicate 110 0) 

difference :: [Int] -> [Int] -> [Int]
difference as bs = map (+minb) $ findIndicesL (>0) $ zipWith (-) (counter bms) (counter ams)
  where
    minb = minimum bs
    ams  = map ((flip (-)) minb) as
    bms  = map ((flip (-)) minb) bs 

main :: IO ()
main = do
  na <- readLn :: IO Int
  anumbers <- fmap (map read . words) getLine
  nb <- readLn :: IO Int
  bnumbers <- fmap (map read . words) getLine
  putStrLn . (intercalate " ") . (map show) $ difference anumbers bnumbers
#+END_SRC
