docs/challenges.html
<div id="outline-container-org681b9fb" class="outline-5">
<h5 id="org681b9fb">Rotate String</h5>
<div class="outline-text-5" id="text-org681b9fb">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span>

<span style="color: #cae682;">rotations</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">String</span>]
<span style="color: #cae682;">rotations</span> s <span style="color: #cae682;">=</span> tail <span style="color: #cae682;">$</span> zipWith (<span style="color: #cae682;">++</span>) (tails s) (inits s)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  strings <span style="color: #cae682;">&lt;-</span> input
  <span style="color: #8ac6f2; font-weight: bold;">let</span> output <span style="color: #cae682;">=</span> map ((intercalate <span style="color: #95e454;">" "</span>) <span style="color: #cae682;">.</span> rotations) strings
  mapM_ putStrLn output
  
<span style="color: #cae682;">input</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> [<span style="color: #92a65e; font-weight: bold;">String</span>]
<span style="color: #cae682;">input</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  sequence <span style="color: #cae682;">$</span> map (<span style="color: #cae682;">\</span>i <span style="color: #cae682;">-&gt;</span> getLine) [1<span style="color: #cae682;">..</span>n]
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb785dac" class="outline-5">
<h5 id="orgb785dac">Remove Duplicates</h5>
<div class="outline-text-5" id="text-orgb785dac">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Char</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Bits</span>

<span style="color: #8ac6f2; font-weight: bold;">type</span> <span style="color: #92a65e; font-weight: bold;">Bit32</span> <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">Int</span>

<span style="color: #cae682;">indexChar</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Char</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">indexChar</span> c <span style="color: #cae682;">=</span> (ord c) <span style="color: #cae682;">-</span> (ord <span style="color: #95e454;">'a'</span>)

<span style="color: #cae682;">isChar</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Bit32</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Char</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">isChar</span> a c <span style="color: #cae682;">=</span> testBit a (indexChar c)

<span style="color: #cae682;">setChar</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Bit32</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Char</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bit32</span>
<span style="color: #cae682;">setChar</span> a c <span style="color: #cae682;">=</span> setBit a (indexChar c)


<span style="color: #cae682;">duplicates</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">duplicates</span> xs <span style="color: #cae682;">=</span> duplicates' 0 xs

<span style="color: #cae682;">duplicates'</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Bit32</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">duplicates'</span> <span style="color: #8ac6f2; font-weight: bold;">_</span> <span style="color: #92a65e; font-weight: bold;">[]</span>     <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">duplicates'</span> b (x<span style="color: #92a65e; font-weight: bold;">:</span>xs)
  <span style="color: #cae682;">|</span> (isChar b x)  <span style="color: #cae682;">=</span> duplicates' b xs
  <span style="color: #cae682;">|</span> otherwise     <span style="color: #cae682;">=</span> x <span style="color: #92a65e; font-weight: bold;">:</span> (duplicates' (setChar b x) xs)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  string <span style="color: #cae682;">&lt;-</span> getLine
  putStrLn (duplicates string)
</pre>
</div>
</div>
</div>
<div id="outline-container-org03cca53" class="outline-5">
<h5 id="org03cca53">Huge GCD</h5>
<div class="outline-text-5" id="text-org03cca53">
<div class="org-src-container">
<pre class="src src-haskell">(<span style="color: #cae682;">*.</span>) a b <span style="color: #cae682;">=</span> mod (a<span style="color: #cae682;">*</span>b) 1000000007

<span style="color: #cae682;">hugegcd</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">hugegcd</span> as bs <span style="color: #cae682;">=</span> fst <span style="color: #cae682;">$</span> foldr gcdr (1,bs) as
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    gcdr <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">Int</span>,[<span style="color: #92a65e; font-weight: bold;">Int</span>]) <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">Int</span>,[<span style="color: #92a65e; font-weight: bold;">Int</span>])
    gcdr a (g,br) <span style="color: #cae682;">=</span> (g <span style="color: #cae682;">*.</span> ng, nbr)
      <span style="color: #8ac6f2; font-weight: bold;">where</span>
        (ng,nbr) <span style="color: #cae682;">=</span> gcda a br

<span style="color: #cae682;">gcda</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> (<span style="color: #92a65e; font-weight: bold;">Int</span>,[<span style="color: #92a65e; font-weight: bold;">Int</span>])
<span style="color: #cae682;">gcda</span> a <span style="color: #92a65e; font-weight: bold;">[]</span>     <span style="color: #cae682;">=</span> (1,<span style="color: #92a65e; font-weight: bold;">[]</span>)
<span style="color: #cae682;">gcda</span> a (b<span style="color: #92a65e; font-weight: bold;">:</span>bs) <span style="color: #cae682;">=</span> (d <span style="color: #cae682;">*.</span> g, (quot b d)<span style="color: #92a65e; font-weight: bold;">:</span>ls)
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    d      <span style="color: #cae682;">=</span> gcd a b
    (g,ls) <span style="color: #cae682;">=</span> gcda (quot a d) bs


<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  a <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  lista <span style="color: #cae682;">&lt;-</span> fmap ((map read) <span style="color: #cae682;">.</span> words) getLine
  b <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  listb <span style="color: #cae682;">&lt;-</span> fmap ((map read) <span style="color: #cae682;">.</span> words) getLine
  putStrLn <span style="color: #cae682;">.</span> show <span style="color: #cae682;">$</span> hugegcd lista listb
</pre>
</div>
</div>
</div>
<div id="outline-container-org586517d" class="outline-5">
<h5 id="org586517d">Missing Numbers (FP)</h5>
<div class="outline-text-5" id="text-org586517d">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Prelude</span> <span style="color: #8ac6f2; font-weight: bold;">hiding</span> (replicate, zipWith)
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span> <span style="color: #8ac6f2; font-weight: bold;">hiding</span> (replicate, zipWith)
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Sequence</span>

<span style="color: #cae682;">counter</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Seq</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">counter</span> <span style="color: #cae682;">=</span> foldr (adjust (<span style="color: #cae682;">+</span>1)) (replicate 110 0) 

<span style="color: #cae682;">difference</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>] <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">difference</span> as bs <span style="color: #cae682;">=</span> map (<span style="color: #cae682;">+</span>minb) <span style="color: #cae682;">$</span> findIndicesL (<span style="color: #cae682;">&gt;</span>0) <span style="color: #cae682;">$</span> zipWith (<span style="color: #cae682;">-</span>) (counter bms) (counter ams)
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    minb <span style="color: #cae682;">=</span> minimum bs
    ams  <span style="color: #cae682;">=</span> map ((flip (<span style="color: #cae682;">-</span>)) minb) as
    bms  <span style="color: #cae682;">=</span> map ((flip (<span style="color: #cae682;">-</span>)) minb) bs 

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  na <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  anumbers <span style="color: #cae682;">&lt;-</span> fmap (map read <span style="color: #cae682;">.</span> words) getLine
  nb <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  bnumbers <span style="color: #cae682;">&lt;-</span> fmap (map read <span style="color: #cae682;">.</span> words) getLine
  putStrLn <span style="color: #cae682;">.</span> (intercalate <span style="color: #95e454;">" "</span>) <span style="color: #cae682;">.</span> (map show) <span style="color: #cae682;">$</span> difference anumbers bnumbers
</pre>
</div>
</div>
</div>
