challenges.org
**** Common divisors
#+BEGIN_SRC haskell
import Data.List
import Control.Monad
import Control.Arrow

factors :: Int -> [Int]
factors n = fact 2 n
  where
    fact d n
      | d > n          = []
      | (mod n d == 0) = d : fact d (quot n d)
      | otherwise      = fact (succ d) n

primefactors :: Int -> [(Int,Int)]
primefactors n = (map (head &&& length)) . group $ (factors n)

divisors :: Int -> Int
divisors n = product $ map ((+1) . snd) (primefactors n)

commondivisors :: Int -> Int -> Int
commondivisors x y = divisors $ gcd x y

main = do
  n <- readLn :: IO Int
  replicateM_ n (
    do
      (a,b) <- fmap ((\[x,y] -> (x,y)) . (map read) . words) getLine
      putStrLn . show $ commondivisors a b
    )
#+END_SRC
**** Captain Prime
#+BEGIN_SRC haskell
import Data.List

primes :: [Int]
primes = 2 : filter isPrime [3,5..]

isPrime :: Int -> Bool
isPrime x = (x>1) && (all (\n -> x `mod` n /= 0) $
            takeWhile (\n -> n * n <= x) primes)

leftReminders :: Int -> [Int]
leftReminders n = map read $ init $ tails (show n)

rightReminders :: Int -> [Int]
rightReminders 0 = []
rightReminders n = n : rightReminders (quot n 10)

haszero :: Int -> Bool
haszero n = elem '0' (show n)

fate :: Int -> String
fate n
  | haszero n     = "DEAD"
  | left && right = "CENTRAL"
  | left          = "LEFT"
  | right         = "RIGHT"
  | otherwise     = "DEAD"
  where
    left  = and (map isPrime $ leftReminders n)
    right = and (map isPrime $ rightReminders n)

main :: IO ()
main = do
  cases <- readLn 
  numbers <- mapM (\i -> readLn) [1..cases]
  let strings = map fate numbers
  mapM_ putStrLn strings
#+END_SRC
** Mathematics
*** Algebra
**** Easy sum
#+BEGIN_SRC haskell
import Control.Monad
import Control.Applicative
import Data.Bits

sumTo :: Int -> Int
sumTo k = (k*(k+1)) `shiftR` 1

easysum :: Int -> Int -> Int
easysum n m = (n `div` m) * (sumTo (m-1)) + (sumTo r)
    where r = n `mod` m

main :: IO ()
main = do
    cases <- readLn :: IO Int
    replicateM_ cases $ do
        [n,m] <- map read <$> words <$> getLine
        putStrLn $ show $ easysum n m
#+END_SRC
** Cracking the code interview
*** Data Structures
**** Arrays: Left Rotation
