docs/challenges.html
<div id="outline-container-org5432522" class="outline-5">
<h5 id="org5432522">Common divisors</h5>
<div class="outline-text-5" id="text-org5432522">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Arrow</span>

<span style="color: #cae682;">factors</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">factors</span> n <span style="color: #cae682;">=</span> fact 2 n
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    fact d n
      <span style="color: #cae682;">|</span> d <span style="color: #cae682;">&gt;</span> n          <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
      <span style="color: #cae682;">|</span> (mod n d <span style="color: #cae682;">==</span> 0) <span style="color: #cae682;">=</span> d <span style="color: #92a65e; font-weight: bold;">:</span> fact d (quot n d)
      <span style="color: #cae682;">|</span> otherwise      <span style="color: #cae682;">=</span> fact (succ d) n

<span style="color: #cae682;">primefactors</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [(<span style="color: #92a65e; font-weight: bold;">Int</span>,<span style="color: #92a65e; font-weight: bold;">Int</span>)]
<span style="color: #cae682;">primefactors</span> n <span style="color: #cae682;">=</span> (map (head <span style="color: #cae682;">&amp;&amp;&amp;</span> length)) <span style="color: #cae682;">.</span> group <span style="color: #cae682;">$</span> (factors n)

<span style="color: #cae682;">divisors</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">divisors</span> n <span style="color: #cae682;">=</span> product <span style="color: #cae682;">$</span> map ((<span style="color: #cae682;">+</span>1) <span style="color: #cae682;">.</span> snd) (primefactors n)

<span style="color: #cae682;">commondivisors</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">commondivisors</span> x y <span style="color: #cae682;">=</span> divisors <span style="color: #cae682;">$</span> gcd x y

<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  n <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  replicateM_ n (
    <span style="color: #8ac6f2; font-weight: bold;">do</span>
      (a,b) <span style="color: #cae682;">&lt;-</span> fmap ((<span style="color: #cae682;">\</span>[x,y] <span style="color: #cae682;">-&gt;</span> (x,y)) <span style="color: #cae682;">.</span> (map read) <span style="color: #cae682;">.</span> words) getLine
      putStrLn <span style="color: #cae682;">.</span> show <span style="color: #cae682;">$</span> commondivisors a b
    )
</pre>
</div>
</div>
</div>
<div id="outline-container-org9aa6e89" class="outline-5">
<h5 id="org9aa6e89">Captain Prime</h5>
<div class="outline-text-5" id="text-org9aa6e89">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span>

<span style="color: #cae682;">primes</span> <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">primes</span> <span style="color: #cae682;">=</span> 2 <span style="color: #92a65e; font-weight: bold;">:</span> filter isPrime [3,5<span style="color: #cae682;">..</span>]

<span style="color: #cae682;">isPrime</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">isPrime</span> x <span style="color: #cae682;">=</span> (x<span style="color: #cae682;">&gt;</span>1) <span style="color: #cae682;">&amp;&amp;</span> (all (<span style="color: #cae682;">\</span>n <span style="color: #cae682;">-&gt;</span> x <span style="color: #cae682;">`mod`</span> n <span style="color: #cae682;">/=</span> 0) <span style="color: #cae682;">$</span>
            takeWhile (<span style="color: #cae682;">\</span>n <span style="color: #cae682;">-&gt;</span> n <span style="color: #cae682;">*</span> n <span style="color: #cae682;">&lt;=</span> x) primes)

<span style="color: #cae682;">leftReminders</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">leftReminders</span> n <span style="color: #cae682;">=</span> map read <span style="color: #cae682;">$</span> init <span style="color: #cae682;">$</span> tails (show n)

<span style="color: #cae682;">rightReminders</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
<span style="color: #cae682;">rightReminders</span> 0 <span style="color: #cae682;">=</span> <span style="color: #92a65e; font-weight: bold;">[]</span>
<span style="color: #cae682;">rightReminders</span> n <span style="color: #cae682;">=</span> n <span style="color: #92a65e; font-weight: bold;">:</span> rightReminders (quot n 10)

<span style="color: #cae682;">haszero</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Bool</span>
<span style="color: #cae682;">haszero</span> n <span style="color: #cae682;">=</span> elem <span style="color: #95e454;">'0'</span> (show n)

<span style="color: #cae682;">fate</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">String</span>
<span style="color: #cae682;">fate</span> n
  <span style="color: #cae682;">|</span> haszero n     <span style="color: #cae682;">=</span> <span style="color: #95e454;">"DEAD"</span>
  <span style="color: #cae682;">|</span> left <span style="color: #cae682;">&amp;&amp;</span> right <span style="color: #cae682;">=</span> <span style="color: #95e454;">"CENTRAL"</span>
  <span style="color: #cae682;">|</span> left          <span style="color: #cae682;">=</span> <span style="color: #95e454;">"LEFT"</span>
  <span style="color: #cae682;">|</span> right         <span style="color: #cae682;">=</span> <span style="color: #95e454;">"RIGHT"</span>
  <span style="color: #cae682;">|</span> otherwise     <span style="color: #cae682;">=</span> <span style="color: #95e454;">"DEAD"</span>
  <span style="color: #8ac6f2; font-weight: bold;">where</span>
    left  <span style="color: #cae682;">=</span> and (map isPrime <span style="color: #cae682;">$</span> leftReminders n)
    right <span style="color: #cae682;">=</span> and (map isPrime <span style="color: #cae682;">$</span> rightReminders n)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  cases <span style="color: #cae682;">&lt;-</span> readLn 
  numbers <span style="color: #cae682;">&lt;-</span> mapM (<span style="color: #cae682;">\</span>i <span style="color: #cae682;">-&gt;</span> readLn) [1<span style="color: #cae682;">..</span>cases]
  <span style="color: #8ac6f2; font-weight: bold;">let</span> strings <span style="color: #cae682;">=</span> map fate numbers
  mapM_ putStrLn strings
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-orgd575ccd" class="outline-3">
<h3 id="orgd575ccd">Mathematics</h3>
<div class="outline-text-3" id="text-orgd575ccd">
</div><div id="outline-container-org2664027" class="outline-4">
<h4 id="org2664027">Algebra</h4>
<div class="outline-text-4" id="text-org2664027">
</div><div id="outline-container-org43bfb28" class="outline-5">
<h5 id="org43bfb28">Easy sum</h5>
<div class="outline-text-5" id="text-org43bfb28">
<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Monad</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Applicative</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.Bits</span>

<span style="color: #cae682;">sumTo</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">sumTo</span> k <span style="color: #cae682;">=</span> (k<span style="color: #cae682;">*</span>(k<span style="color: #cae682;">+</span>1)) <span style="color: #cae682;">`shiftR`</span> 1

<span style="color: #cae682;">easysum</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
<span style="color: #cae682;">easysum</span> n m <span style="color: #cae682;">=</span> (n <span style="color: #cae682;">`div`</span> m) <span style="color: #cae682;">*</span> (sumTo (m<span style="color: #cae682;">-</span>1)) <span style="color: #cae682;">+</span> (sumTo r)
    <span style="color: #8ac6f2; font-weight: bold;">where</span> r <span style="color: #cae682;">=</span> n <span style="color: #cae682;">`mod`</span> m

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
    cases <span style="color: #cae682;">&lt;-</span> readLn <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
    replicateM_ cases <span style="color: #cae682;">$</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
        [n,m] <span style="color: #cae682;">&lt;-</span> map read <span style="color: #cae682;">&lt;$&gt;</span> words <span style="color: #cae682;">&lt;$&gt;</span> getLine
        putStrLn <span style="color: #cae682;">$</span> show <span style="color: #cae682;">$</span> easysum n m
</pre>
</div>
</div>
</div>
</div>
</div>
<div id="outline-container-org8d16ef7" class="outline-3">
<h3 id="org8d16ef7">Cracking the code interview</h3>
<div class="outline-text-3" id="text-org8d16ef7">
</div><div id="outline-container-org96d4cca" class="outline-4">
<h4 id="org96d4cca">Data Structures</h4>
<div class="outline-text-4" id="text-org96d4cca">
</div><div id="outline-container-orgd0ff32f" class="outline-5">
<h5 id="orgd0ff32f">Arrays: Left Rotation</h5>
