challenges.org
***** C++ version
#+BEGIN_SRC c++
  #include <vector>
  #include <iostream>
  using namespace std;

  vector<int> array_left_rotation(vector<int> a, int n, int k) {
      vector<int> result;
      for (int i=0; i<a.size(); i++)
          result.push_back(a[(i+k)%n]);
      return result;
  }

  int main(){
      int n;
      int k;
      cin >> n >> k;
      vector<int> a(n);
      for(int a_i = 0;a_i < n;a_i++){
          cin >> a[a_i];
      }
      vector<int> output = array_left_rotation(a, n, k);
      for(int i = 0; i < n;i++)
          cout << output[i] << " ";
      cout << endl;
      return 0;
  }
#+END_SRC

***** Haskell version
We are using a list in Haskell instead of an array.
Time complexity is the same, anyway. Using Data.Sequence
would not lead us to a better complexity.

#+BEGIN_SRC haskell
  import Control.Applicative
  import Data.List

  rotate :: Int -> [a] -> [a]
  rotate k xs = take (length xs) $ drop k (cycle xs)

  main :: IO ()
  main = do
    -- Input
    nt <- words <$> getLine
    let t = read $ nt!!1 :: Int
    larray <- (map read) . words <$> getLine
    -- Output
    let result = rotate t larray :: [Int]
    putStrLn (concat $ intersperse " " (map show result))
#+END_SRC

**** Strings: Making Anagrams
#+BEGIN_SRC cpp
  #include <vector>
  #include <cmath>
  #include <iostream>
  using namespace std;

  int number_needed(string a, string b) {
    vector<int> counting;
    for (int i=0; i<26; i++)
      counting.push_back(0);
    
    for (char c : a)
      counting[c-'a']++;
    for (char c : b)
      counting[c-'a']--;
    
    int sum = 0;
    for (int n : counting)
      sum += abs(n);
    
    return sum;
  }

  int main(){
    string a;
    cin >> a;
    string b;
    cin >> b;
    cout << number_needed(a, b) << endl;
    return 0;
  }
#+END_SRC
**** Hash Tables: Ransom Note
#+BEGIN_SRC cpp
  #include<vector>
  #include<iostream>
  #include<unordered_map>
  #include<string>
  using namespace std;

  int main() {
    bool answer = true;
    int mag_words;
    int ran_words;
    cin >> mag_words >> ran_words;

    unordered_map<string,int> magazine;
    for (int i=0; i<mag_words; i++) {
      string read;
      cin >> read;
      magazine.emplace(read,0);
      magazine[read]++;    
    }

    for (int i=0; i<ran_words and answer; i++) {
      string read;
      cin >> read;
      if (magazine.count(read) == 0 or magazine[read] == 0) {
        answer = false;
        break;
      }

      magazine[read]--;
    }


    if (answer)
      cout << "Yes";
    else
      cout << "No";
  }
#+END_SRC
