docs/challenges.html
<div class="outline-text-5" id="text-orgd0ff32f">
</div><div id="outline-container-org7424d67" class="outline-6">
<h6 id="org7424d67">C++ version</h6>
<div class="outline-text-6" id="text-org7424d67">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">array_left_rotation</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">a</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">k</span>) {
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">result</span>;
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;a.size(); i++)
        result.push_back(a[(i+k)%n]);
    <span style="color: #8ac6f2; font-weight: bold;">return</span> result;
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>(){
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>;
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">k</span>;
    cin &gt;&gt; n &gt;&gt; k;
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">a</span>(n);
    <span style="color: #8ac6f2; font-weight: bold;">for</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a_i</span> = 0;a_i &lt; n;a_i++){
        cin &gt;&gt; a[a_i];
    }
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">output</span> = array_left_rotation(a, n, k);
    <span style="color: #8ac6f2; font-weight: bold;">for</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span> = 0; i &lt; n;i++)
        cout &lt;&lt; output[i] &lt;&lt; <span style="color: #95e454;">" "</span>;
    cout &lt;&lt; endl;
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org2525126" class="outline-6">
<h6 id="org2525126">Haskell version</h6>
<div class="outline-text-6" id="text-org2525126">
<p>
We are using a list in Haskell instead of an array.
Time complexity is the same, anyway. Using Data.Sequence
would not lead us to a better complexity.
</p>

<div class="org-src-container">
<pre class="src src-haskell"><span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Control.Applicative</span>
<span style="color: #8ac6f2; font-weight: bold;">import</span> <span style="color: #92a65e; font-weight: bold;">Data.List</span>

<span style="color: #cae682;">rotate</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span> <span style="color: #cae682;">-&gt;</span> [a] <span style="color: #cae682;">-&gt;</span> [a]
<span style="color: #cae682;">rotate</span> k xs <span style="color: #cae682;">=</span> take (length xs) <span style="color: #cae682;">$</span> drop k (cycle xs)

<span style="color: #cae682;">main</span> <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">IO</span> <span style="color: #92a65e; font-weight: bold;">()</span>
<span style="color: #cae682;">main</span> <span style="color: #cae682;">=</span> <span style="color: #8ac6f2; font-weight: bold;">do</span>
  <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Input</span>
  nt <span style="color: #cae682;">&lt;-</span> words <span style="color: #cae682;">&lt;$&gt;</span> getLine
  <span style="color: #8ac6f2; font-weight: bold;">let</span> t <span style="color: #cae682;">=</span> read <span style="color: #cae682;">$</span> nt<span style="color: #cae682;">!!</span>1 <span style="color: #cae682;">::</span> <span style="color: #92a65e; font-weight: bold;">Int</span>
  larray <span style="color: #cae682;">&lt;-</span> (map read) <span style="color: #cae682;">.</span> words <span style="color: #cae682;">&lt;$&gt;</span> getLine
  <span style="color: #5F7F5F;">-- </span><span style="color: #99968b;">Output</span>
  <span style="color: #8ac6f2; font-weight: bold;">let</span> result <span style="color: #cae682;">=</span> rotate t larray <span style="color: #cae682;">::</span> [<span style="color: #92a65e; font-weight: bold;">Int</span>]
  putStrLn (concat <span style="color: #cae682;">$</span> intersperse <span style="color: #95e454;">" "</span> (map show result))
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org68cbe08" class="outline-5">
<h5 id="org68cbe08">Strings: Making Anagrams</h5>
<div class="outline-text-5" id="text-org68cbe08">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;cmath&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">number_needed</span>(<span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">a</span>, <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">b</span>) {
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">counting</span>;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;26; i++)
    counting.push_back(0);

  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">char</span> <span style="color: #cae682;">c</span> : a)
    counting[c-<span style="color: #95e454;">'a'</span>]++;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">char</span> <span style="color: #cae682;">c</span> : b)
    counting[c-<span style="color: #95e454;">'a'</span>]--;

  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">sum</span> = 0;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span> : counting)
    sum += abs(n);

  <span style="color: #8ac6f2; font-weight: bold;">return</span> sum;
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>(){
  <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">a</span>;
  cin &gt;&gt; a;
  <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">b</span>;
  cin &gt;&gt; b;
  cout &lt;&lt; number_needed(a, b) &lt;&lt; endl;
  <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org6abd542" class="outline-5">
<h5 id="org6abd542">Hash Tables: Ransom Note</h5>
<div class="outline-text-5" id="text-org6abd542">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;unordered_map&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;string&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">answer</span> = <span style="color: #e5786d;">true</span>;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">mag_words</span>;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">ran_words</span>;
  cin &gt;&gt; mag_words &gt;&gt; ran_words;

  <span style="color: #92a65e; font-weight: bold;">unordered_map</span>&lt;<span style="color: #92a65e; font-weight: bold;">string</span>,<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">magazine</span>;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;mag_words; i++) {
    <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">read</span>;
    cin &gt;&gt; read;
    magazine.emplace(read,0);
    magazine[read]++;    
  }

  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;ran_words <span style="color: #8ac6f2; font-weight: bold;">and</span> answer; i++) {
    <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">read</span>;
    cin &gt;&gt; read;
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (magazine.count(read) == 0 <span style="color: #8ac6f2; font-weight: bold;">or</span> magazine[read] == 0) {
      answer = <span style="color: #e5786d;">false</span>;
      <span style="color: #8ac6f2; font-weight: bold;">break</span>;
    }

    magazine[read]--;
  }


  <span style="color: #8ac6f2; font-weight: bold;">if</span> (answer)
    cout &lt;&lt; <span style="color: #95e454;">"Yes"</span>;
  <span style="color: #8ac6f2; font-weight: bold;">else</span>
    cout &lt;&lt; <span style="color: #95e454;">"No"</span>;
}
</pre>
</div>
</div>
</div>
