docs/challenges.html
<div id="outline-container-org67aef77" class="outline-5">
<h5 id="org67aef77">Linked Lists: Detect a cycle</h5>
<div class="outline-text-5" id="text-org67aef77">
<p>
This solution uses two <b>fast and slow</b> pointers. The main idea
is that if you put two pointers into a cycle of length \(n\) separated by a
distance of \(a\) and move them, one at a speed of \(1\) and the other at a 
speed of \(2\); they will eventually collide after \(a\) steps.
</p>

<p>
\[ a + n \equiv 2n \]
\[a \equiv n\]
\[\]
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">has_cycle</span>(<span style="color: #92a65e; font-weight: bold;">Node</span>* <span style="color: #cae682;">head</span>) {
    <span style="color: #92a65e; font-weight: bold;">Node</span>* <span style="color: #cae682;">slow</span> = head;
    <span style="color: #92a65e; font-weight: bold;">Node</span>* <span style="color: #cae682;">fast</span> = head;
    <span style="color: #8ac6f2; font-weight: bold;">while</span> ((slow != <span style="color: #e5786d;">nullptr</span>) <span style="color: #8ac6f2; font-weight: bold;">and</span> (fast != <span style="color: #e5786d;">nullptr</span>) <span style="color: #8ac6f2; font-weight: bold;">and</span> (fast-&gt;next != <span style="color: #e5786d;">nullptr</span>)) {
        slow = slow-&gt;next;
        fast = fast-&gt;next-&gt;next;
        <span style="color: #8ac6f2; font-weight: bold;">if</span> (slow == fast)
            <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">true</span>;
    }
        
    <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;
}
</pre>
</div>
</div>
</div>

<div id="outline-container-org081e022" class="outline-5">
<h5 id="org081e022">Stacks: Balanced Brackets</h5>
<div class="outline-text-5" id="text-org081e022">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;stack&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">is_balanced</span>(<span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">expression</span>) {
  <span style="color: #92a65e; font-weight: bold;">stack</span>&lt;<span style="color: #92a65e; font-weight: bold;">char</span>&gt; <span style="color: #cae682;">brackets</span>;

  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">char</span> <span style="color: #cae682;">current</span> : expression) {     
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (current == <span style="color: #95e454;">'{'</span> <span style="color: #8ac6f2; font-weight: bold;">or</span> current == <span style="color: #95e454;">'('</span> <span style="color: #8ac6f2; font-weight: bold;">or</span> current == <span style="color: #95e454;">'['</span>)
          brackets.push(current);
      <span style="color: #8ac6f2; font-weight: bold;">else</span> <span style="color: #8ac6f2; font-weight: bold;">if</span> (<span style="color: #8ac6f2; font-weight: bold;">not</span> brackets.empty() <span style="color: #8ac6f2; font-weight: bold;">and</span>
                (((current == <span style="color: #95e454;">'}'</span>) <span style="color: #8ac6f2; font-weight: bold;">and</span> (brackets.top() == <span style="color: #95e454;">'{'</span>)) <span style="color: #8ac6f2; font-weight: bold;">or</span>
                ((current == <span style="color: #95e454;">')'</span>) <span style="color: #8ac6f2; font-weight: bold;">and</span> (brackets.top() == <span style="color: #95e454;">'('</span>)) <span style="color: #8ac6f2; font-weight: bold;">or</span>
                ((current == <span style="color: #95e454;">']'</span>) <span style="color: #8ac6f2; font-weight: bold;">and</span> (brackets.top() == <span style="color: #95e454;">'['</span>)))
              )
              brackets.pop();
          <span style="color: #8ac6f2; font-weight: bold;">else</span>
              <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;
      }

  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">It has to be empty!</span>
  <span style="color: #8ac6f2; font-weight: bold;">return</span> brackets.empty();
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>(){
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">t</span>;
    cin &gt;&gt; t;
    <span style="color: #8ac6f2; font-weight: bold;">for</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a0</span> = 0; a0 &lt; t; a0++){
        <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">expression</span>;
        cin &gt;&gt; expression;
        <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">answer</span> = is_balanced(expression);
        <span style="color: #8ac6f2; font-weight: bold;">if</span>(answer)
            cout &lt;&lt; <span style="color: #95e454;">"YES\n"</span>;
        <span style="color: #8ac6f2; font-weight: bold;">else</span> cout &lt;&lt; <span style="color: #95e454;">"NO\n"</span>;
    }
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgb3c89a8" class="outline-5">
<h5 id="orgb3c89a8">Queues: A tale of two stacks</h5>
<div class="outline-text-5" id="text-orgb3c89a8">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;cmath&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;cstdio&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;algorithm&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;stack&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;queue&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">MyQueue</span> {
  
    <span style="color: #8ac6f2; font-weight: bold;">public</span>:
        <span style="color: #92a65e; font-weight: bold;">stack</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">stack_newest_on_top</span>, <span style="color: #cae682;">stack_oldest_on_top</span>;   
        <span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">push</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">x</span>) {
            stack_newest_on_top.push(x);
        }

        <span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">pop</span>() {
            <span style="color: #8ac6f2; font-weight: bold;">if</span> (stack_oldest_on_top.empty())
                refill();
            stack_oldest_on_top.pop();
        }

        <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">front</span>() {
            <span style="color: #8ac6f2; font-weight: bold;">if</span> (stack_oldest_on_top.empty())
                refill();
            <span style="color: #8ac6f2; font-weight: bold;">return</span> stack_oldest_on_top.top();
        }
    
        <span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">refill</span>() {
            <span style="color: #8ac6f2; font-weight: bold;">while</span>(<span style="color: #8ac6f2; font-weight: bold;">not</span> stack_newest_on_top.empty()) {
                stack_oldest_on_top.push(stack_newest_on_top.top());
                stack_newest_on_top.pop();
            }
        }
};

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
    <span style="color: #92a65e; font-weight: bold;">MyQueue</span> <span style="color: #cae682;">q1</span>;
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">q</span>, <span style="color: #cae682;">type</span>, <span style="color: #cae682;">x</span>;
    cin &gt;&gt; q;
    
    <span style="color: #8ac6f2; font-weight: bold;">for</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span> = 0; i &lt; q; i++) {
        cin &gt;&gt; type;
        <span style="color: #8ac6f2; font-weight: bold;">if</span>(type == 1) {
            cin &gt;&gt; x;
            q1.push(x);
        }
        <span style="color: #8ac6f2; font-weight: bold;">else</span> <span style="color: #8ac6f2; font-weight: bold;">if</span>(type == 2) {
            q1.pop();
        }
        <span style="color: #8ac6f2; font-weight: bold;">else</span> cout &lt;&lt; q1.front() &lt;&lt; endl;
    }

    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgd4865ef" class="outline-5">
<h5 id="orgd4865ef">Trees: Is this a binary search tree?</h5>
<div class="outline-text-5" id="text-orgd4865ef">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">checkBST</span>(<span style="color: #92a65e; font-weight: bold;">Node</span>* <span style="color: #cae682;">root</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">return</span> checkBSTBounds(root,-1,-1);
}

<span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">checkBSTBounds</span>(<span style="color: #92a65e; font-weight: bold;">Node</span>* <span style="color: #cae682;">root</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">lower</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">upper</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>root)
        <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">true</span>;

    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">data</span> = root-&gt;data;
    <span style="color: #8ac6f2; font-weight: bold;">return</span> ((upper == -1 <span style="color: #8ac6f2; font-weight: bold;">or</span> data &lt; upper) <span style="color: #8ac6f2; font-weight: bold;">and</span> (lower == -1 <span style="color: #8ac6f2; font-weight: bold;">or</span> data &gt; lower)) <span style="color: #8ac6f2; font-weight: bold;">and</span>
           checkBSTBounds(root-&gt;left, lower, data) <span style="color: #8ac6f2; font-weight: bold;">and</span>
           checkBSTBounds(root-&gt;right, data, upper);
}
</pre>
</div>
</div>
</div>
