challenges.org
**** Heaps: Find the running median
#+BEGIN_SRC c++
  #include<vector>
  #include<algorithm>
  #include<iostream>
  #include<iomanip>

  using namespace std;

  int main() {
    cout << fixed << setprecision(1);
    vector<int> left_heap;
    vector<int> right_heap;
    float median;

    // Reads first case
    unsigned cases;
    cin >> cases;
    cin >> median;
    left_heap.push_back(median);
    push_heap(left_heap.begin(), left_heap.end(), greater<int>());
    cout << median << endl;

    for (unsigned i=1; i<cases; i++) {
      // Inserts new value
      int new_value; cin >> new_value;
      if (new_value > median) {
        right_heap.push_back(new_value);
        push_heap(right_heap.begin(), right_heap.end(), greater<int>());
      }
      else {
        left_heap.push_back(new_value);
        push_heap(left_heap.begin(), left_heap.end(), less<int>());
      }

      // Rebalances both heaps
      if (right_heap.size() > left_heap.size()) {
        int moving = right_heap[0];
        pop_heap(right_heap.begin(), right_heap.end(), greater<int>());
        right_heap.pop_back();

        left_heap.push_back(moving);
        push_heap(left_heap.begin(), left_heap.end(), less<int>());
      }
      if (left_heap.size() > right_heap.size()+1) {
        int moving = left_heap[0];
        pop_heap(left_heap.begin(), left_heap.end(), less<int>());
        left_heap.pop_back();

        right_heap.push_back(moving);
        push_heap(right_heap.begin(), right_heap.end(), greater<int>());
      }

      // Prints median
      if (i%2 != 0)
        median = (left_heap[0]+right_heap[0])/2.0;
      else
        median = left_heap[0];
      cout << median << endl;
    }
  }
#+END_SRC
**** Tries: Contacts
#+BEGIN_SRC c++
  #include<iostream>
  #include<string>
  #include<iomanip>
  using namespace std;

  struct trie {
    int counter;
    trie* children[26];
  };

  trie* create() {
    trie* t = new trie;
    t->counter = 0;
    for (int i=0; i<26; i++)
      t->children[i] = nullptr;
    return t;
  }


  void insert(trie* root, string s) {
    trie* current = root;
    for (char c : s) {
      trie* next = current -> children[c-'a'];
      if (next == nullptr) {
        trie* newtrie = create();
        current->children[c-'a'] = newtrie;
        current = newtrie;
      }
      else
        current = next; 
      current->counter++;
    }
  }


  int count(trie* root, string s) {
    trie* current = root;

    for (char c : s) {
      trie* next = current -> children[c-'a'];
      if (next == nullptr) {
        return 0;
      }
      else {
        current = next;
      }
    }

    return current -> counter;
  }


  int main() {
    trie* t = create();
    int cases; 
    cin >> cases;

    while(cases--) {
      string op, word;
      cin >> op >> word;
      if (op == "add")
        insert(t, word);
      else
        cout << count(t, word) << endl;     
    }
  }
#+END_SRC
*** Algorithms
**** Sorting: Bubble Sort
**** Sorting: Comparator
#+BEGIN_SRC python
  class Player:
      def __init__(self, name, score):
          self.name = name
          self.score = score
        
      def __repr__(self):
          pass
        
      def comparator(a, b):
          if (a.score == b.score):
              return cmp(a.name,b.name)
          else:
              return cmp(b.score,a.score)
#+END_SRC
