docs/challenges.html
<div id="outline-container-org494e0a0" class="outline-5">
<h5 id="org494e0a0">Heaps: Find the running median</h5>
<div class="outline-text-5" id="text-org494e0a0">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;algorithm&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iomanip&gt;</span>

<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  cout &lt;&lt; fixed &lt;&lt; setprecision(1);
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">left_heap</span>;
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">right_heap</span>;
  <span style="color: #92a65e; font-weight: bold;">float</span> <span style="color: #cae682;">median</span>;

  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Reads first case</span>
  <span style="color: #92a65e; font-weight: bold;">unsigned</span> <span style="color: #cae682;">cases</span>;
  cin &gt;&gt; cases;
  cin &gt;&gt; median;
  left_heap.push_back(median);
  push_heap(left_heap.begin(), left_heap.end(), greater&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
  cout &lt;&lt; median &lt;&lt; endl;

  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">unsigned</span> <span style="color: #cae682;">i</span>=1; i&lt;cases; i++) {
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Inserts new value</span>
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">new_value</span>; cin &gt;&gt; new_value;
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (new_value &gt; median) {
      right_heap.push_back(new_value);
      push_heap(right_heap.begin(), right_heap.end(), greater&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
    }
    <span style="color: #8ac6f2; font-weight: bold;">else</span> {
      left_heap.push_back(new_value);
      push_heap(left_heap.begin(), left_heap.end(), less&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
    }

    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Rebalances both heaps</span>
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (right_heap.size() &gt; left_heap.size()) {
      <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">moving</span> = right_heap[0];
      pop_heap(right_heap.begin(), right_heap.end(), greater&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
      right_heap.pop_back();

      left_heap.push_back(moving);
      push_heap(left_heap.begin(), left_heap.end(), less&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
    }
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (left_heap.size() &gt; right_heap.size()+1) {
      <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">moving</span> = left_heap[0];
      pop_heap(left_heap.begin(), left_heap.end(), less&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
      left_heap.pop_back();

      right_heap.push_back(moving);
      push_heap(right_heap.begin(), right_heap.end(), greater&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
    }

    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Prints median</span>
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (i%2 != 0)
      median = (left_heap[0]+right_heap[0])/2.0;
    <span style="color: #8ac6f2; font-weight: bold;">else</span>
      median = left_heap[0];
    cout &lt;&lt; median &lt;&lt; endl;
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgf846cbd" class="outline-5">
<h5 id="orgf846cbd">Tries: Contacts</h5>
<div class="outline-text-5" id="text-orgf846cbd">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;string&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iomanip&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #8ac6f2; font-weight: bold;">struct</span> <span style="color: #92a65e; font-weight: bold;">trie</span> {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">counter</span>;
  <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">children</span>[26];
};

<span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">create</span>() {
  <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">t</span> = <span style="color: #8ac6f2; font-weight: bold;">new</span> <span style="color: #92a65e; font-weight: bold;">trie</span>;
  t-&gt;counter = 0;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;26; i++)
    t-&gt;children[i] = <span style="color: #e5786d;">nullptr</span>;
  <span style="color: #8ac6f2; font-weight: bold;">return</span> t;
}


<span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">insert</span>(<span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">root</span>, <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">s</span>) {
  <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">current</span> = root;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">char</span> <span style="color: #cae682;">c</span> : s) {
    <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">next</span> = current -&gt; children[c-<span style="color: #95e454;">'a'</span>];
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (next == <span style="color: #e5786d;">nullptr</span>) {
      <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">newtrie</span> = create();
      current-&gt;children[c-<span style="color: #95e454;">'a'</span>] = newtrie;
      current = newtrie;
    }
    <span style="color: #8ac6f2; font-weight: bold;">else</span>
      current = next; 
    current-&gt;counter++;
  }
}


<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">count</span>(<span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">root</span>, <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">s</span>) {
  <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">current</span> = root;

  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">char</span> <span style="color: #cae682;">c</span> : s) {
    <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">next</span> = current -&gt; children[c-<span style="color: #95e454;">'a'</span>];
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (next == <span style="color: #e5786d;">nullptr</span>) {
      <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
    }
    <span style="color: #8ac6f2; font-weight: bold;">else</span> {
      current = next;
    }
  }

  <span style="color: #8ac6f2; font-weight: bold;">return</span> current -&gt; counter;
}


<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">trie</span>* <span style="color: #cae682;">t</span> = create();
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">cases</span>; 
  cin &gt;&gt; cases;

  <span style="color: #8ac6f2; font-weight: bold;">while</span>(cases--) {
    <span style="color: #92a65e; font-weight: bold;">string</span> <span style="color: #cae682;">op</span>, <span style="color: #cae682;">word</span>;
    cin &gt;&gt; op &gt;&gt; word;
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (op == <span style="color: #95e454;">"add"</span>)
      insert(t, word);
    <span style="color: #8ac6f2; font-weight: bold;">else</span>
      cout &lt;&lt; count(t, word) &lt;&lt; endl;     
  }
}
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-org1b8d5d9" class="outline-4">
<h4 id="org1b8d5d9">Algorithms</h4>
<div class="outline-text-4" id="text-org1b8d5d9">
</div><div id="outline-container-org6a59fff" class="outline-5">
<h5 id="org6a59fff">Sorting: Bubble Sort</h5>
</div>
<div id="outline-container-org4364c4b" class="outline-5">
<h5 id="org4364c4b">Sorting: Comparator</h5>
<div class="outline-text-5" id="text-org4364c4b">
<div class="org-src-container">
<pre class="src src-python"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Player</span>:
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">__init__</span>(<span style="color: #8ac6f2; font-weight: bold;">self</span>, name, score):
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">self</span>.name = name
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">self</span>.score = score

<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">__repr__</span>(<span style="color: #8ac6f2; font-weight: bold;">self</span>):
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">pass</span>

<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">def</span> <span style="color: #cae682;">comparator</span>(a, b):
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">if</span> (a.score == b.score):
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d; font-weight: bold;">cmp</span>(a.name,b.name)
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">else</span>:
<span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #DCDCCC; background-color: #303030;"> </span>   <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d; font-weight: bold;">cmp</span>(b.score,a.score)
</pre>
</div>
</div>
</div>
