challenges.org
**** Merge Sort: Counting Inversions
#+BEGIN_SRC cpp
  #include<vector>
  #include<iostream>
  using namespace std;
  typedef long long int lli;

  lli merge(vector<int>& array, int left, int right) {
    lli swaps = 0;
    int middle = (left+right)/2;
    vector<int> left_array(array.begin()+left, array.begin()+middle);
    vector<int> right_array(array.begin()+middle, array.begin()+right);

    int i = 0;
    int j = 0;
    int k = left;

    while (i < left_array.size() and j < right_array.size()) {
      if (left_array[i] <= right_array[j]) {
        array[k] = left_array[i];
        i++;
        k++;
      }
      else {
        array[k] = right_array[j];
        j++;
        k++;
        swaps += left_array.size()-i;
      }
    }


    while (i < left_array.size()) {
      array[k] = left_array[i];
      i++;
      k++;
    }

    while (j < right_array.size()) {
      array[k] = right_array[j];
      j++;
      k++;
    }

    return swaps;
  }


  lli mergesort(vector<int>& array, int left, int right) {
    if (right-left < 2)
      return 0;

    lli swaps = 0;
    int middle = (left+right)/2;
    swaps += mergesort(array, left, middle);
    swaps += mergesort(array, middle, right);
    swaps += merge(array, left, right);    

    return swaps;
  }


  int main() {
    int d; cin >> d;
    for (int cases=0; cases<d; cases++) {
      int n; cin >> n;
      vector<int> array(n);
      for (int i=0; i<n; i++)
        cin >> array[i];
      cout << mergesort(array,0,array.size()) << endl;
    }
  }
#+END_SRC
**** Binary Search: Ice Cream Parlor
#+BEGIN_SRC cpp
  #include <bits/stdc++.h>
  using namespace std;

  class IceCream {
    
  public: 
    int flavor; 
    int index;

    IceCream(int flavor, int index) {
      this->flavor = flavor;
      this->index = index;
    }
  };

  bool compare(IceCream a, IceCream b) {
    return a.flavor < b.flavor;
  }

  int binarySearch(int first, int last, vector<IceCream> arr, int search) {
    int middle = (first+last)/2;

    while (arr[middle].flavor != search) {
      if (first > last)
        return -1;
            
      if (arr[middle].flavor < search) {
        first = middle+1;
        middle = (first+last)/2;
      }
      else if (arr[middle].flavor > search) {
        last = middle-1;
        middle = (first+last)/2;
      }
    }
    
    return arr[middle].index;
  }

  int main() {
    int t;
    int n, m;
    cin >> t;
    for(int test = 0; test < t; test++) {       
      cin >> m >> n;
      vector<IceCream> arr;
      arr.reserve(n); 

      for (int i = 0; i < n; i++) {
        int cost;
        cin >> cost;
        arr.push_back(IceCream(cost, i + 1));
      }

      sort(arr.begin(), arr.end(), compare);
      int firstIndex = 100000, secondIndex = 100000;
      for(int i = 0; i < n - 1 ; i++) {
        int search = m - arr[i].flavor;
        if(search >= arr[i].flavor) {
          int index = binarySearch( i + 1, n - 1, arr, search);
          if( index != -1 ) {
            cout << min(arr[i].index, index) << " " << max(arr[i].index, index) << endl;
            break;

          }
        }
      }

    }

  }
#+END_SRC
