docs/challenges.html
<div id="outline-container-orge3f2f18" class="outline-5">
<h5 id="orge3f2f18">Merge Sort: Counting Inversions</h5>
<div class="outline-text-5" id="text-orge3f2f18">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;
<span style="color: #8ac6f2; font-weight: bold;">typedef</span> <span style="color: #92a65e; font-weight: bold;">long</span> <span style="color: #92a65e; font-weight: bold;">long</span> <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #92a65e; font-weight: bold;">lli</span>;

<span style="color: #92a65e; font-weight: bold;">lli</span> <span style="color: #cae682;">merge</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&amp; <span style="color: #cae682;">array</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">left</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">right</span>) {
  <span style="color: #92a65e; font-weight: bold;">lli</span> <span style="color: #cae682;">swaps</span> = 0;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">middle</span> = (left+right)/2;
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">left_array</span>(array.begin()+left, array.begin()+middle);
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">right_array</span>(array.begin()+middle, array.begin()+right);

  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span> = 0;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">j</span> = 0;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">k</span> = left;

  <span style="color: #8ac6f2; font-weight: bold;">while</span> (i &lt; left_array.size() <span style="color: #8ac6f2; font-weight: bold;">and</span> j &lt; right_array.size()) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (left_array[i] &lt;= right_array[j]) {
      array[k] = left_array[i];
      i++;
      k++;
    }
    <span style="color: #8ac6f2; font-weight: bold;">else</span> {
      array[k] = right_array[j];
      j++;
      k++;
      swaps += left_array.size()-i;
    }
  }


  <span style="color: #8ac6f2; font-weight: bold;">while</span> (i &lt; left_array.size()) {
    array[k] = left_array[i];
    i++;
    k++;
  }

  <span style="color: #8ac6f2; font-weight: bold;">while</span> (j &lt; right_array.size()) {
    array[k] = right_array[j];
    j++;
    k++;
  }

  <span style="color: #8ac6f2; font-weight: bold;">return</span> swaps;
}


<span style="color: #92a65e; font-weight: bold;">lli</span> <span style="color: #cae682;">mergesort</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&amp; <span style="color: #cae682;">array</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">left</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">right</span>) {
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (right-left &lt; 2)
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;

  <span style="color: #92a65e; font-weight: bold;">lli</span> <span style="color: #cae682;">swaps</span> = 0;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">middle</span> = (left+right)/2;
  swaps += mergesort(array, left, middle);
  swaps += mergesort(array, middle, right);
  swaps += merge(array, left, right);    

  <span style="color: #8ac6f2; font-weight: bold;">return</span> swaps;
}


<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">d</span>; cin &gt;&gt; d;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">cases</span>=0; cases&lt;d; cases++) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>; cin &gt;&gt; n;
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">array</span>(n);
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;n; i++)
      cin &gt;&gt; array[i];
    cout &lt;&lt; mergesort(array,0,array.size()) &lt;&lt; endl;
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org3528d24" class="outline-5">
<h5 id="org3528d24">Binary Search: Ice Cream Parlor</h5>
<div class="outline-text-5" id="text-org3528d24">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;bits/stdc++.h&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">IceCream</span> {

<span style="color: #8ac6f2; font-weight: bold;">public</span>: 
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">flavor</span>; 
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">index</span>;

  <span style="color: #cae682;">IceCream</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">flavor</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">index</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">this</span>-&gt;flavor = flavor;
    <span style="color: #8ac6f2; font-weight: bold;">this</span>-&gt;index = index;
  }
};

<span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">compare</span>(<span style="color: #92a65e; font-weight: bold;">IceCream</span> <span style="color: #cae682;">a</span>, <span style="color: #92a65e; font-weight: bold;">IceCream</span> <span style="color: #cae682;">b</span>) {
  <span style="color: #8ac6f2; font-weight: bold;">return</span> a.flavor &lt; b.flavor;
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">binarySearch</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">first</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">last</span>, <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">IceCream</span>&gt; <span style="color: #cae682;">arr</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">search</span>) {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">middle</span> = (first+last)/2;

  <span style="color: #8ac6f2; font-weight: bold;">while</span> (arr[middle].flavor != search) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (first &gt; last)
      <span style="color: #8ac6f2; font-weight: bold;">return</span> -1;

    <span style="color: #8ac6f2; font-weight: bold;">if</span> (arr[middle].flavor &lt; search) {
      first = middle+1;
      middle = (first+last)/2;
    }
    <span style="color: #8ac6f2; font-weight: bold;">else</span> <span style="color: #8ac6f2; font-weight: bold;">if</span> (arr[middle].flavor &gt; search) {
      last = middle-1;
      middle = (first+last)/2;
    }
  }

  <span style="color: #8ac6f2; font-weight: bold;">return</span> arr[middle].index;
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">t</span>;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>, <span style="color: #cae682;">m</span>;
  cin &gt;&gt; t;
  <span style="color: #8ac6f2; font-weight: bold;">for</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">test</span> = 0; test &lt; t; test++) {       
    cin &gt;&gt; m &gt;&gt; n;
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">IceCream</span>&gt; <span style="color: #cae682;">arr</span>;
    arr.reserve(n); 

    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span> = 0; i &lt; n; i++) {
      <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">cost</span>;
      cin &gt;&gt; cost;
      arr.push_back(IceCream(cost, i + 1));
    }

    sort(arr.begin(), arr.end(), compare);
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">firstIndex</span> = 100000, <span style="color: #cae682;">secondIndex</span> = 100000;
    <span style="color: #8ac6f2; font-weight: bold;">for</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span> = 0; i &lt; n - 1 ; i++) {
      <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">search</span> = m - arr[i].flavor;
      <span style="color: #8ac6f2; font-weight: bold;">if</span>(search &gt;= arr[i].flavor) {
        <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">index</span> = binarySearch( i + 1, n - 1, arr, search);
        <span style="color: #8ac6f2; font-weight: bold;">if</span>( index != -1 ) {
          cout &lt;&lt; min(arr[i].index, index) &lt;&lt; <span style="color: #95e454;">" "</span> &lt;&lt; max(arr[i].index, index) &lt;&lt; endl;
          <span style="color: #8ac6f2; font-weight: bold;">break</span>;

        }
      }
    }

  }

}
</pre>
</div>
</div>
</div>
