challenges.org
**** DFS: Connected Cell in a Grid
#+BEGIN_SRC cpp
  #include<vector>
  #include<iostream>
  using namespace std;
  typedef vector<vector<bool> > Matrix;

  int count_region(Matrix& matrix, int i, int j) {
      matrix[i][j] = false;
      int sum = 1;
    
      for (int a = -1; a<2; a++)
          for (int b = -1; b<2; b++)
              if (i+a < matrix.size() and i+a >= 0)
                  if (j+a < matrix.size() and j+b >= 0)
                      if (matrix[i+a][j+b])
                          sum += count_region(matrix,i+a,j+b);

      return sum;
  }


  int larger_region(Matrix& matrix) {
      int max_region = 0;

      for (unsigned i=0; i<matrix.size(); i++) 
          for (unsigned j=0; j<matrix[i].size(); j++) 
              if (matrix[i][j]) {
                  int new_region = count_region(matrix,i,j);
                  if (new_region > max_region)
                      max_region = new_region;
              }

      return max_region;
  }


  int main() {
      Matrix matrix;
      int n,m;
      cin >> n; cin >> m;
      for (int i=0; i<n; i++) {
          vector<bool> row;
          for (int j=0; j<m; j++) {
              int read;
              cin >> read;
              row.push_back(read == 1);
          }
          matrix.push_back(row);
      }

      cout << larger_region(matrix);
  }
#+END_SRC
**** BFS: Shortest Reach
#+BEGIN_SRC cpp
  #include<vector>
  #include<queue>
  #include<iostream>
  using namespace std;
  typedef vector< vector<int> > Graph;

  int main() {
    int cases;
    cin >> cases;
    for (int k=0; k<cases; k++) {
      int nodes;
      int edges;
      cin >> nodes >> edges;
      Graph graph(nodes, vector<int>());
      vector<int> distance(nodes, -1);
      queue<int> to_visit;

      for (int i=0; i<edges; i++) {
        int a, b;
        cin >> a >> b;
        a = a-1;
        b = b-1;
        graph[a].push_back(b);
        graph[b].push_back(a);
      }

      int initial_node;
      cin >> initial_node;
      initial_node = initial_node-1;
      to_visit.push(initial_node);
      distance[initial_node] = 0;

      while (!to_visit.empty()) {
        int current = to_visit.front();
        to_visit.pop();
            
        for (int i=0; i<graph[current].size(); i++) {
          int next = graph[current][i];
          if (distance[next] == -1) {
            distance[next] = distance[current] + 6;
            to_visit.push(next);
          }
        }
      }

      for (int i=0; i<distance.size(); i++)
        if (i != initial_node)
          cout << distance[i] << " ";
      cout << endl;
    }
  }
#+END_SRC

*** Techniques
**** Time complexity: Primality
#+BEGIN_SRC c++
  #include<iostream>
  #include<cmath>
  using namespace std;

  int main() {
    int cases; cin >> cases;
    for (int i=0; i<cases; i++) {
      int input; cin >> input;
      bool is_prime = true;

      if (not (input > 1))
        is_prime = false;
    
      // Primality checker
      int root = (int) sqrt(input)+1;
      for (int i=2; i<root and is_prime; i++)
        is_prime = (input % i != 0);

      if (is_prime)
        cout << "Prime" << endl;
      else
        cout << "Not prime" << endl;
    }
  }
#+END_SRC
