docs/challenges.html
<div id="outline-container-orgf6eb329" class="outline-5">
<h5 id="orgf6eb329">DFS: Connected Cell in a Grid</h5>
<div class="outline-text-5" id="text-orgf6eb329">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;
<span style="color: #8ac6f2; font-weight: bold;">typedef</span> <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">bool</span>&gt; &gt; <span style="color: #92a65e; font-weight: bold;">Matrix</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">count_region</span>(<span style="color: #92a65e; font-weight: bold;">Matrix</span>&amp; <span style="color: #cae682;">matrix</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">j</span>) {
    matrix[i][j] = <span style="color: #e5786d;">false</span>;
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">sum</span> = 1;

    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a</span> = -1; a&lt;2; a++)
        <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">b</span> = -1; b&lt;2; b++)
            <span style="color: #8ac6f2; font-weight: bold;">if</span> (i+a &lt; matrix.size() <span style="color: #8ac6f2; font-weight: bold;">and</span> i+a &gt;= 0)
                <span style="color: #8ac6f2; font-weight: bold;">if</span> (j+a &lt; matrix.size() <span style="color: #8ac6f2; font-weight: bold;">and</span> j+b &gt;= 0)
                    <span style="color: #8ac6f2; font-weight: bold;">if</span> (matrix[i+a][j+b])
                        sum += count_region(matrix,i+a,j+b);

    <span style="color: #8ac6f2; font-weight: bold;">return</span> sum;
}


<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">larger_region</span>(<span style="color: #92a65e; font-weight: bold;">Matrix</span>&amp; <span style="color: #cae682;">matrix</span>) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">max_region</span> = 0;

    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">unsigned</span> <span style="color: #cae682;">i</span>=0; i&lt;matrix.size(); i++) 
        <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">unsigned</span> <span style="color: #cae682;">j</span>=0; j&lt;matrix[i].size(); j++) 
            <span style="color: #8ac6f2; font-weight: bold;">if</span> (matrix[i][j]) {
                <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">new_region</span> = count_region(matrix,i,j);
                <span style="color: #8ac6f2; font-weight: bold;">if</span> (new_region &gt; max_region)
                    max_region = new_region;
            }

    <span style="color: #8ac6f2; font-weight: bold;">return</span> max_region;
}


<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
    <span style="color: #92a65e; font-weight: bold;">Matrix</span> <span style="color: #cae682;">matrix</span>;
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>,<span style="color: #cae682;">m</span>;
    cin &gt;&gt; n; cin &gt;&gt; m;
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;n; i++) {
        <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">bool</span>&gt; <span style="color: #cae682;">row</span>;
        <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">j</span>=0; j&lt;m; j++) {
            <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">read</span>;
            cin &gt;&gt; read;
            row.push_back(read == 1);
        }
        matrix.push_back(row);
    }

    cout &lt;&lt; larger_region(matrix);
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org4683a4f" class="outline-5">
<h5 id="org4683a4f">BFS: Shortest Reach</h5>
<div class="outline-text-5" id="text-org4683a4f">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;queue&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;
<span style="color: #8ac6f2; font-weight: bold;">typedef</span> <span style="color: #92a65e; font-weight: bold;">vector</span>&lt; <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; &gt; <span style="color: #92a65e; font-weight: bold;">Graph</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">cases</span>;
  cin &gt;&gt; cases;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">k</span>=0; k&lt;cases; k++) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">nodes</span>;
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">edges</span>;
    cin &gt;&gt; nodes &gt;&gt; edges;
    <span style="color: #92a65e; font-weight: bold;">Graph</span> <span style="color: #cae682;">graph</span>(nodes, vector&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">distance</span>(nodes, -1);
    <span style="color: #92a65e; font-weight: bold;">queue</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">to_visit</span>;

    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;edges; i++) {
      <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a</span>, <span style="color: #cae682;">b</span>;
      cin &gt;&gt; a &gt;&gt; b;
      a = a-1;
      b = b-1;
      graph[a].push_back(b);
      graph[b].push_back(a);
    }

    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">initial_node</span>;
    cin &gt;&gt; initial_node;
    initial_node = initial_node-1;
    to_visit.push(initial_node);
    distance[initial_node] = 0;

    <span style="color: #8ac6f2; font-weight: bold;">while</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>to_visit.empty()) {
      <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">current</span> = to_visit.front();
      to_visit.pop();

      <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;graph[current].size(); i++) {
        <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">next</span> = graph[current][i];
        <span style="color: #8ac6f2; font-weight: bold;">if</span> (distance[next] == -1) {
          distance[next] = distance[current] + 6;
          to_visit.push(next);
        }
      }
    }

    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;distance.size(); i++)
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (i != initial_node)
        cout &lt;&lt; distance[i] &lt;&lt; <span style="color: #95e454;">" "</span>;
    cout &lt;&lt; endl;
  }
}
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-org2371a8c" class="outline-4">
<h4 id="org2371a8c">Techniques</h4>
<div class="outline-text-4" id="text-org2371a8c">
</div><div id="outline-container-org05b0925" class="outline-5">
<h5 id="org05b0925">Time complexity: Primality</h5>
<div class="outline-text-5" id="text-org05b0925">
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;cmath&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">cases</span>; cin &gt;&gt; cases;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;cases; i++) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">input</span>; cin &gt;&gt; input;
    <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">is_prime</span> = <span style="color: #e5786d;">true</span>;

    <span style="color: #8ac6f2; font-weight: bold;">if</span> (<span style="color: #8ac6f2; font-weight: bold;">not</span> (input &gt; 1))
      is_prime = <span style="color: #e5786d;">false</span>;

    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Primality checker</span>
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">root</span> = (<span style="color: #92a65e; font-weight: bold;">int</span>) sqrt(input)+1;
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=2; i&lt;root <span style="color: #8ac6f2; font-weight: bold;">and</span> is_prime; i++)
      is_prime = (input % i != 0);

    <span style="color: #8ac6f2; font-weight: bold;">if</span> (is_prime)
      cout &lt;&lt; <span style="color: #95e454;">"Prime"</span> &lt;&lt; endl;
    <span style="color: #8ac6f2; font-weight: bold;">else</span>
      cout &lt;&lt; <span style="color: #95e454;">"Not prime"</span> &lt;&lt; endl;
  }
}
</pre>
</div>
</div>
</div>
