challenges.org
**** Recursion: Fibonacci numbers
We *won't use recursion* directly as I want to write a ${\cal O}(log(n))$ solution using matrices.
It uses bit manipulation in order to get the binary decomposition of the input.
#+BEGIN_SRC c++
  #include<vector>
  #include<iostream>
  using namespace std;

  typedef vector<int> Matrix;

  Matrix product(Matrix& a, Matrix& b) {
    Matrix prod;
    prod[0] = a[0]*b[0]+a[1]*b[2];
    prod[1] = a[0]*b[1]+a[1]*b[3];
    prod[2] = a[2]*b[0]+a[3]*b[2];
    prod[3] = a[2]*b[1]+a[3]*b[3];
    return prod;
  }

  int main() {
    int input; cin >> input;
    Matrix fib;
    fib.push_back(1);
    fib.push_back(1);
    fib.push_back(1);
    fib.push_back(0);
    Matrix result;
    result.push_back(1);
    result.push_back(0);
    result.push_back(0);
    result.push_back(1);

    while (input) {
      if (input & 1)
        result = product(result,fib);

      fib = product(fib,fib);
      input = (input >> 1);
    }

    cout << result[1] << endl;
  }
#+END_SRC
**** Recursion: Davis' Staircase
#+BEGIN_SRC cpp
  #include<vector>
  #include<iostream>
  using namespace std;
  vector<int> solutions;

  int ways_staircase(int staircase) {
    if (staircase < 0)
      return 0;
    if (staircase < solutions.size() and solutions[staircase] != -1)
      return solutions[staircase];

    int sum = 0;
    sum += ways_staircase(staircase-1);
    sum += ways_staircase(staircase-2);
    sum += ways_staircase(staircase-3);

    while (solutions.size() < staircase)
      solutions.push_back(-1);
    if (solutions.size() == staircase)
      solutions.push_back(staircase);
    if (staircase < solutions.size())
      solutions[staircase] = sum;
    
    return sum;
  }


  int main() {
    solutions.push_back(1);

    int cases; cin >> cases;
    for (int i=0; i<cases; i++) {
      int staircase;
      cin >> staircase;
      cout << ways_staircase(staircase) << endl;
    }
  }
#+END_SRC
**** DP: Coin Change
***** Naive approach
A naive solution using ${\cal O}(nm)$ space.

#+BEGIN_SRC cpp
  #include<vector>
  #include<iostream>
  using namespace std;
  typedef vector< vector<long long> > Matrix;
  typedef long long int lli;

  lli ways_change(Matrix& ways, vector<int>& coins, int dollars, int limit_coin) {
    if (dollars < 0)
      return 0;
    if (dollars == 0)
      return 1;
    if (limit_coin >= coins.size())
      return 0;

    if (ways[dollars][limit_coin] != -1)
      return ways[dollars][limit_coin];

    lli counter = 0;
    counter += ways_change(ways, coins, dollars-coins[limit_coin], limit_coin);
    counter += ways_change(ways, coins, dollars, limit_coin+1);
    
    ways[dollars][limit_coin] = counter;
    return counter;
  }


  int main() {
    int n;
    int m;
    cin >> n >> m;
    Matrix ways(n+1, vector<lli>(m,-1));
    vector<int> coins;

    for (int i=0; i<m; i++) {
      int read;
      cin >> read;
      coins.push_back(read);
    }

    cout << ways_change(ways,coins,n,0);
  }
#+END_SRC

***** Better solution
A better solution using ${\cal O}(n)$ space.

#+BEGIN_SRC cpp
  #include<vector>
  #include<iostream>
  using namespace std;
  typedef long long int lli;

  int main() {
    int n, m;
    cin >> n >> m;
    vector<int> coins(m);
    for (int i=0; i<m; i++)
      cin >> coins[i];

    vector<lli> ways(n+1,0);
    ways[0] = 1;

    for (int i=0; i < coins.size(); i++)
      for (int j=coins[i]; j < ways.size(); j++)
        ways[j] += ways[j-coins[i]];

    cout << ways[n];
  }
#+END_SRC
