docs/challenges.html
<div id="outline-container-org512e510" class="outline-5">
<h5 id="org512e510">Recursion: Fibonacci numbers</h5>
<div class="outline-text-5" id="text-org512e510">
<p>
We <b>won't use recursion</b> directly as I want to write a \({\cal O}(log(n))\) solution using matrices.
It uses bit manipulation in order to get the binary decomposition of the input.
</p>
<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #8ac6f2; font-weight: bold;">typedef</span> <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #92a65e; font-weight: bold;">Matrix</span>;

<span style="color: #92a65e; font-weight: bold;">Matrix</span> <span style="color: #cae682;">product</span>(<span style="color: #92a65e; font-weight: bold;">Matrix</span>&amp; <span style="color: #cae682;">a</span>, <span style="color: #92a65e; font-weight: bold;">Matrix</span>&amp; <span style="color: #cae682;">b</span>) {
  <span style="color: #92a65e; font-weight: bold;">Matrix</span> <span style="color: #cae682;">prod</span>;
  prod[0] = a[0]*b[0]+a[1]*b[2];
  prod[1] = a[0]*b[1]+a[1]*b[3];
  prod[2] = a[2]*b[0]+a[3]*b[2];
  prod[3] = a[2]*b[1]+a[3]*b[3];
  <span style="color: #8ac6f2; font-weight: bold;">return</span> prod;
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">input</span>; cin &gt;&gt; input;
  <span style="color: #92a65e; font-weight: bold;">Matrix</span> <span style="color: #cae682;">fib</span>;
  fib.push_back(1);
  fib.push_back(1);
  fib.push_back(1);
  fib.push_back(0);
  <span style="color: #92a65e; font-weight: bold;">Matrix</span> <span style="color: #cae682;">result</span>;
  result.push_back(1);
  result.push_back(0);
  result.push_back(0);
  result.push_back(1);

  <span style="color: #8ac6f2; font-weight: bold;">while</span> (input) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (input &amp; 1)
      result = product(result,fib);

    fib = product(fib,fib);
    input = (input &gt;&gt; 1);
  }

  cout &lt;&lt; result[1] &lt;&lt; endl;
}
</pre>
</div>
</div>
</div>
<div id="outline-container-org2ec9848" class="outline-5">
<h5 id="org2ec9848">Recursion: Davis' Staircase</h5>
<div class="outline-text-5" id="text-org2ec9848">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;
<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">solutions</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">ways_staircase</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">staircase</span>) {
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (staircase &lt; 0)
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (staircase &lt; solutions.size() <span style="color: #8ac6f2; font-weight: bold;">and</span> solutions[staircase] != -1)
    <span style="color: #8ac6f2; font-weight: bold;">return</span> solutions[staircase];

  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">sum</span> = 0;
  sum += ways_staircase(staircase-1);
  sum += ways_staircase(staircase-2);
  sum += ways_staircase(staircase-3);

  <span style="color: #8ac6f2; font-weight: bold;">while</span> (solutions.size() &lt; staircase)
    solutions.push_back(-1);
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (solutions.size() == staircase)
    solutions.push_back(staircase);
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (staircase &lt; solutions.size())
    solutions[staircase] = sum;

  <span style="color: #8ac6f2; font-weight: bold;">return</span> sum;
}


<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  solutions.push_back(1);

  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">cases</span>; cin &gt;&gt; cases;
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;cases; i++) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">staircase</span>;
    cin &gt;&gt; staircase;
    cout &lt;&lt; ways_staircase(staircase) &lt;&lt; endl;
  }
}
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdd79276" class="outline-5">
<h5 id="orgdd79276">DP: Coin Change</h5>
<div class="outline-text-5" id="text-orgdd79276">
</div><div id="outline-container-orgd2fa7d4" class="outline-6">
<h6 id="orgd2fa7d4">Naive approach</h6>
<div class="outline-text-6" id="text-orgd2fa7d4">
<p>
A naive solution using \({\cal O}(nm)\) space.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;
<span style="color: #8ac6f2; font-weight: bold;">typedef</span> <span style="color: #92a65e; font-weight: bold;">vector</span>&lt; <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">long</span> <span style="color: #92a65e; font-weight: bold;">long</span>&gt; &gt; <span style="color: #92a65e; font-weight: bold;">Matrix</span>;
<span style="color: #8ac6f2; font-weight: bold;">typedef</span> <span style="color: #92a65e; font-weight: bold;">long</span> <span style="color: #92a65e; font-weight: bold;">long</span> <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #92a65e; font-weight: bold;">lli</span>;

<span style="color: #92a65e; font-weight: bold;">lli</span> <span style="color: #cae682;">ways_change</span>(<span style="color: #92a65e; font-weight: bold;">Matrix</span>&amp; <span style="color: #cae682;">ways</span>, <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&amp; <span style="color: #cae682;">coins</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">dollars</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">limit_coin</span>) {
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (dollars &lt; 0)
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (dollars == 0)
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 1;
  <span style="color: #8ac6f2; font-weight: bold;">if</span> (limit_coin &gt;= coins.size())
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;

  <span style="color: #8ac6f2; font-weight: bold;">if</span> (ways[dollars][limit_coin] != -1)
    <span style="color: #8ac6f2; font-weight: bold;">return</span> ways[dollars][limit_coin];

  <span style="color: #92a65e; font-weight: bold;">lli</span> <span style="color: #cae682;">counter</span> = 0;
  counter += ways_change(ways, coins, dollars-coins[limit_coin], limit_coin);
  counter += ways_change(ways, coins, dollars, limit_coin+1);

  ways[dollars][limit_coin] = counter;
  <span style="color: #8ac6f2; font-weight: bold;">return</span> counter;
}


<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>;
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">m</span>;
  cin &gt;&gt; n &gt;&gt; m;
  <span style="color: #92a65e; font-weight: bold;">Matrix</span> <span style="color: #cae682;">ways</span>(n+1, vector&lt;<span style="color: #92a65e; font-weight: bold;">lli</span>&gt;(m,-1));
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">coins</span>;

  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;m; i++) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">read</span>;
    cin &gt;&gt; read;
    coins.push_back(read);
  }

  cout &lt;&lt; ways_change(ways,coins,n,0);
}
</pre>
</div>
</div>
</div>

<div id="outline-container-orgbf693a8" class="outline-6">
<h6 id="orgbf693a8">Better solution</h6>
<div class="outline-text-6" id="text-orgbf693a8">
<p>
A better solution using \({\cal O}(n)\) space.
</p>

<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span><span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;
<span style="color: #8ac6f2; font-weight: bold;">typedef</span> <span style="color: #92a65e; font-weight: bold;">long</span> <span style="color: #92a65e; font-weight: bold;">long</span> <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #92a65e; font-weight: bold;">lli</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>() {
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>, <span style="color: #cae682;">m</span>;
  cin &gt;&gt; n &gt;&gt; m;
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">coins</span>(m);
  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;m; i++)
    cin &gt;&gt; coins[i];

  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">lli</span>&gt; <span style="color: #cae682;">ways</span>(n+1,0);
  ways[0] = 1;

  <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i &lt; coins.size(); i++)
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">j</span>=coins[i]; j &lt; ways.size(); j++)
      ways[j] += ways[j-coins[i]];

  cout &lt;&lt; ways[n];
}
</pre>
</div>
</div>
</div>
</div>
