challenges.org
**** Bit manipulation: Lonely integer
Folds using =xor=. Every element will be cancelled out with its pair,
except for the result.

#+BEGIN_SRC c++
#include <vector>
#include <iostream>
using namespace std;

int lonely_integer(vector < int > a) {
    int result = 0;
    for (int i=0; i<a.size(); i++)
        result ^= a[i];
    return result;
}

int main(){
    int n;
    cin >> n;
    vector<int> a(n);
    for(int a_i = 0;a_i < n;a_i++){
       cin >> a[a_i];
    }
    cout << lonely_integer(a) << endl;
    return 0;
}
#+END_SRC
* Interview problems
** Google example interview
Taken from [[https://www.youtube.com/watch?v=XKu_SEDAykw][this youtube video]]:

#+BEGIN_SRC cpp
  bool HasPairWithSum (vector<int>& numbers, int sum) {
    unordered_set<int> complements;
  
    for (int n : numbers) {
      if (complements.find(n) != complements.end())
        return true;
      complements.add(sum-n);
    }

    return false;
  }
#+END_SRC
* Python Kung-fu
From the [[https://github.com/PythonGranada/python-kung-fu/][Python Kung-fu repository]].

** 0. String permutation
Using a vector as a sort of a hash, running in ${\cal O}(n)$.
#+BEGIN_SRC cpp :cmdline <<< 'asdf fsda'
  #include<vector>
  #include<string>
  #include<iostream>
  using namespace std;

  bool is_permutation(string a, string b) {
      vector<int> counter(26,0);
      for (char c : a)
          counter[c-'a']++;
      for (char c : b)
          counter[c-'a']--;

      for (int ocurrences : counter)
          if (ocurrences != 0)
              return false;

      return true;
  }

  int main() {
    string a,b;
    cin >> a >> b;
  
    // Checking that the two sizes are equal discards a lot of
    // edge cases.
    if (a.size() == b.size() and is_permutation(a,b))
      cout << "Permutation";
    else
      cout << "Not a permutation";
  }
#+END_SRC

#+RESULTS:
: Permutation

** 1. Unique characters
*** With a boolean vector
#+BEGIN_SRC cpp :cmdline <<< 'afsgdf'
  #include<vector>
  #include<iostream>
  #include<string>
  #include<stdint.h>
  using namespace std;

  bool unique_chars(string str) {
    if (str.size() > 26)
      return false;

    int32_t counter = 0;
    for (char c : str)
      if ((counter & (1 << (c-'a'))) != 0)
        return false;
      else
        counter |= (1 << (c-'a'));
    return true;
  }

  int main() {
    string str;
    cin >> str;

    if (unique_chars(str))
      cout << "Unique characters";
    else
      cout << "Repeated characters";
  }
#+END_SRC

#+RESULTS:
: Repeated characters

*** Without additional data structures
#+BEGIN_SRC cpp :cmdline <<< 'afsgdf'
  #include<vector>
  #include<algorithm>
  #include<iostream>
  using namespace std;

  bool unique_chars(string str) {
    if (str.size() > 26)
      return false;
    
    make_heap(str.begin(), str.end());
    sort_heap(str.begin(), str.end());
    for (int i=0; i<str.size()-1; i++)
      if (str[i] == str[i+1])
        return false;

    return true;
  }

  int main() {
    string str;
    cin >> str;

    if (unique_chars(str))
      cout << "Unique characters";
    else
      cout << "Repeated characters";
  }
#+END_SRC

#+RESULTS:
: Repeated characters
* Leetcode
