docs/challenges.html
<div id="outline-container-orgb3ec51a" class="outline-5">
<h5 id="orgb3ec51a">Bit manipulation: Lonely integer</h5>
<div class="outline-text-5" id="text-orgb3ec51a">
<p>
Folds using <code>xor</code>. Every element will be cancelled out with its pair,
except for the result.
</p>

<div class="org-src-container">
<pre class="src src-c++"><span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;vector&gt;</span>
<span style="color: #94BFF3;">#include</span> <span style="color: #95e454;">&lt;iostream&gt;</span>
<span style="color: #8ac6f2; font-weight: bold;">using</span> <span style="color: #8ac6f2; font-weight: bold;">namespace</span> <span style="color: #e5786d;">std</span>;

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">lonely_integer</span>(<span style="color: #92a65e; font-weight: bold;">vector</span> &lt; <span style="color: #92a65e; font-weight: bold;">int</span> &gt; <span style="color: #cae682;">a</span>) {
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">result</span> = 0;
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;a.size(); i++)
        result ^= a[i];
    <span style="color: #8ac6f2; font-weight: bold;">return</span> result;
}

<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">main</span>(){
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>;
    cin &gt;&gt; n;
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">a</span>(n);
    <span style="color: #8ac6f2; font-weight: bold;">for</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a_i</span> = 0;a_i &lt; n;a_i++){
       cin &gt;&gt; a[a_i];
    }
    cout &lt;&lt; lonely_integer(a) &lt;&lt; endl;
    <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
}
</pre>
</div>
</div>
</div>
</div>
</div>
