challenges.org
*** Iterative solution: BFS
#+BEGIN_SRC cpp
  class Solution {
  public:
    bool isSymmetric(TreeNode* root) {
      if (root == nullptr)
	return true;

      queue<TreeNode*> lhq;
      queue<TreeNode*> rhq;
      lhq.push(root->left);
      rhq.push(root->right);

      while (!lhq.empty() and !rhq.empty()) {
	TreeNode* fl = lhq.front();
	TreeNode* fr = rhq.front();
	lhq.pop();
	rhq.pop();

	if (fr == nullptr and fl == nullptr)
	  continue;
	if (fl == nullptr or fr == nullptr)
	  return false;
	if (fl->val != fr->val)
	  return false;

	lhq.push(fl->left);
	rhq.push(fr->right);
	lhq.push(fl->right);
	rhq.push(fr->left);
      }


      return (lhq.empty() and rhq.empty());
    }
  };
#+END_SRC

*** Iterative solution: DFS
#+BEGIN_SRC cpp
  class Solution {
  public:
    bool isSymmetric(TreeNode* root) {
      if (root == nullptr)
	return true;

      stack<TreeNode*> lhq;
      stack<TreeNode*> rhq;
      lhq.push(root->left);
      rhq.push(root->right);
        
      while (!lhq.empty() and !rhq.empty()) {
	TreeNode* fl = lhq.top();
	TreeNode* fr = rhq.top();
	lhq.pop();
	rhq.pop();

	if (fl == nullptr and fr != nullptr)
	  return false;
	if (fr == nullptr and fl != nullptr)
	  return false;
	if (fr == nullptr and fl == nullptr)
	  continue;

	if (fl->val != fr->val)
	  return false;
            
	lhq.push(fl->left);
	rhq.push(fr->right);
	lhq.push(fl->right);
	rhq.push(fr->left);
      }

      return (lhq.empty() and rhq.empty());
    }
  };
#+END_SRC
** 113. Path Sum II
#+BEGIN_SRC cpp
  /**
   ,* Definition for a binary tree node.
   ,* struct TreeNode {
   ,*     int val;
   ,*     TreeNode *left;
   ,*     TreeNode *right;
   ,*     TreeNode(int x) : val(x), left(NULL), right(NULL) {}
   ,* };
   ,*/
  class Solution {
  public:
    vector<vector<int>> pathSum(TreeNode* root, int sum) {
      vector<vector<int>> result;
      pathSumAcc(root,sum,result,vector<int>());
      return result;
    }

    void pathSumAcc(TreeNode* root, int sum, vector<vector<int>>& result, vector<int> acc) {
      if (root == nullptr) {
        if (sum == 0 and acc.size() != 0) 
          result.push_back(acc);
        return;
      }
        
      if (root->left == nullptr and root->right == nullptr)
        if (sum == root->val) {
          acc.push_back(root->val);
          result.push_back(acc);
          return;
        }    
        
      acc.push_back(root->val);
      if (root->right != nullptr) pathSumAcc(root->right, sum-root->val, result, acc);
      if (root->left != nullptr) pathSumAcc(root->left, sum-root->val, result, acc);
    }
  };
#+END_SRC
