docs/challenges.html
<div id="outline-container-org1264a6a" class="outline-4">
<h4 id="org1264a6a">Iterative solution: BFS</h4>
<div class="outline-text-4" id="text-org1264a6a">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
  <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">isSymmetric</span>(<span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">root</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (root == <span style="color: #e5786d;">nullptr</span>)
      <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">true</span>;

    <span style="color: #92a65e; font-weight: bold;">queue</span>&lt;<span style="color: #92a65e; font-weight: bold;">TreeNode</span>*&gt; <span style="color: #cae682;">lhq</span>;
    <span style="color: #92a65e; font-weight: bold;">queue</span>&lt;<span style="color: #92a65e; font-weight: bold;">TreeNode</span>*&gt; <span style="color: #cae682;">rhq</span>;
    lhq.push(root-&gt;left);
    rhq.push(root-&gt;right);

    <span style="color: #8ac6f2; font-weight: bold;">while</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>lhq.empty() <span style="color: #8ac6f2; font-weight: bold;">and</span> <span style="color: #F0DFAF; font-weight: bold;">!</span>rhq.empty()) {
      <span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">fl</span> = lhq.front();
      <span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">fr</span> = rhq.front();
      lhq.pop();
      rhq.pop();

      <span style="color: #8ac6f2; font-weight: bold;">if</span> (fr == <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">and</span> fl == <span style="color: #e5786d;">nullptr</span>)
        <span style="color: #8ac6f2; font-weight: bold;">continue</span>;
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (fl == <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">or</span> fr == <span style="color: #e5786d;">nullptr</span>)
        <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (fl-&gt;val != fr-&gt;val)
        <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;

      lhq.push(fl-&gt;left);
      rhq.push(fr-&gt;right);
      lhq.push(fl-&gt;right);
      rhq.push(fr-&gt;left);
    }


    <span style="color: #8ac6f2; font-weight: bold;">return</span> (lhq.empty() <span style="color: #8ac6f2; font-weight: bold;">and</span> rhq.empty());
  }
};
</pre>
</div>
</div>
</div>

<div id="outline-container-orgb4d3379" class="outline-4">
<h4 id="orgb4d3379">Iterative solution: DFS</h4>
<div class="outline-text-4" id="text-orgb4d3379">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
  <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">isSymmetric</span>(<span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">root</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (root == <span style="color: #e5786d;">nullptr</span>)
      <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">true</span>;

    <span style="color: #92a65e; font-weight: bold;">stack</span>&lt;<span style="color: #92a65e; font-weight: bold;">TreeNode</span>*&gt; <span style="color: #cae682;">lhq</span>;
    <span style="color: #92a65e; font-weight: bold;">stack</span>&lt;<span style="color: #92a65e; font-weight: bold;">TreeNode</span>*&gt; <span style="color: #cae682;">rhq</span>;
    lhq.push(root-&gt;left);
    rhq.push(root-&gt;right);

    <span style="color: #8ac6f2; font-weight: bold;">while</span> (<span style="color: #F0DFAF; font-weight: bold;">!</span>lhq.empty() <span style="color: #8ac6f2; font-weight: bold;">and</span> <span style="color: #F0DFAF; font-weight: bold;">!</span>rhq.empty()) {
      <span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">fl</span> = lhq.top();
      <span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">fr</span> = rhq.top();
      lhq.pop();
      rhq.pop();

      <span style="color: #8ac6f2; font-weight: bold;">if</span> (fl == <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">and</span> fr != <span style="color: #e5786d;">nullptr</span>)
        <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (fr == <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">and</span> fl != <span style="color: #e5786d;">nullptr</span>)
        <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (fr == <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">and</span> fl == <span style="color: #e5786d;">nullptr</span>)
        <span style="color: #8ac6f2; font-weight: bold;">continue</span>;

      <span style="color: #8ac6f2; font-weight: bold;">if</span> (fl-&gt;val != fr-&gt;val)
        <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;

      lhq.push(fl-&gt;left);
      rhq.push(fr-&gt;right);
      lhq.push(fl-&gt;right);
      rhq.push(fr-&gt;left);
    }

    <span style="color: #8ac6f2; font-weight: bold;">return</span> (lhq.empty() <span style="color: #8ac6f2; font-weight: bold;">and</span> rhq.empty());
  }
};
</pre>
</div>
</div>
</div>
</div>
<div id="outline-container-orgc2ffbcc" class="outline-3">
<h3 id="orgc2ffbcc">113. Path Sum II</h3>
<div class="outline-text-3" id="text-orgc2ffbcc">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #5F7F5F;">/**</span>
<span style="color: #99968b;"> * Definition for a binary tree node.</span>
<span style="color: #99968b;"> * struct TreeNode {</span>
<span style="color: #99968b;"> *     int val;</span>
<span style="color: #99968b;"> *     TreeNode *left;</span>
<span style="color: #99968b;"> *     TreeNode *right;</span>
<span style="color: #99968b;"> *     TreeNode(int x) : val(x), left(NULL), right(NULL) {}</span>
<span style="color: #99968b;"> * };</span>
<span style="color: #99968b;"> */</span>
<span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
  <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&gt; <span style="color: #cae682;">pathSum</span>(<span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">root</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">sum</span>) {
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&gt; <span style="color: #cae682;">result</span>;
    pathSumAcc(root,sum,result,vector&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;());
    <span style="color: #8ac6f2; font-weight: bold;">return</span> result;
  }

  <span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">pathSumAcc</span>(<span style="color: #92a65e; font-weight: bold;">TreeNode</span>* <span style="color: #cae682;">root</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">sum</span>, <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&gt;&amp; <span style="color: #cae682;">result</span>, <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">acc</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (root == <span style="color: #e5786d;">nullptr</span>) {
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (sum == 0 <span style="color: #8ac6f2; font-weight: bold;">and</span> acc.size() != 0) 
        result.push_back(acc);
      <span style="color: #8ac6f2; font-weight: bold;">return</span>;
    }

    <span style="color: #8ac6f2; font-weight: bold;">if</span> (root-&gt;left == <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">and</span> root-&gt;right == <span style="color: #e5786d;">nullptr</span>)
      <span style="color: #8ac6f2; font-weight: bold;">if</span> (sum == root-&gt;val) {
        acc.push_back(root-&gt;val);
        result.push_back(acc);
        <span style="color: #8ac6f2; font-weight: bold;">return</span>;
      }    

    acc.push_back(root-&gt;val);
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (root-&gt;right != <span style="color: #e5786d;">nullptr</span>) pathSumAcc(root-&gt;right, sum-root-&gt;val, result, acc);
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (root-&gt;left != <span style="color: #e5786d;">nullptr</span>) pathSumAcc(root-&gt;left, sum-root-&gt;val, result, acc);
  }
};
</pre>
</div>
</div>
</div>
