challenges.org
** 219. Contains Duplicate II
#+BEGIN_SRC cpp
  class Solution {
  public:
      bool containsNearbyDuplicate(vector<int>& nums, int k) {
          unordered_set<int> nearby;
        
          for (int i=0; i<nums.size(); i++) {
              if (nearby.find(nums[i]) != nearby.end())
                  return true;
            
              nearby.insert(nums[i]);
            
              if (i>=k)
                  nearby.erase(nums[i-k]);
          }
        
          return false;
      }
  };
#+END_SRC
** 221. Maximal Square
#+BEGIN_SRC cpp
  class Solution {
  public:
    int access(vector<vector<int>>& matrix, int x, int y) {
      if (x < matrix.size() and x >= 0 and y >= 0 and y < matrix[x].size())
        return matrix[x][y];
      else
        return 0;
    }

    int triangle(int left, int right, int up, int down) {
      return (min(min(left,right),up) + 1) * down;
    }
    
    int maximalSquare(vector<vector<char>>& matrix) {
      // Transforms the matrix into an int matrix
      vector<vector<int>> imatrix;
      for (int i=0; i<matrix.size(); i++) {
        vector<int> row;
        for (int j=0; j<matrix[0].size(); j++)
          row.push_back(matrix[i][j]-'0');
        imatrix.push_back(row);
      }
        
      // Finds square
      int max = 0;
      for (int i=0; i<imatrix.size(); i++) {
        for (int j=0; j<imatrix[0].size(); j++) {
          imatrix[i][j] = triangle(access(imatrix, i-1, j), access(imatrix, i, j-1), access(imatrix,i-1,j-1), access(imatrix, i, j));
          cout << imatrix[i][j] << " ";
          if (max < imatrix[i][j])
            max = imatrix[i][j];
        }
        cout << endl;
      }
        
      return max*max;
    }   
  };
#+END_SRC

** 225. Implement Stack using Queues
#+BEGIN_SRC cpp
  class Stack {
  private:
    queue<int> in;
    
    void last_to_head() {
      for (int i=0; i<in.size()-1; i++) {
	in.push(in.front());
	in.pop();
      }
    }
    
  public:
    // Push element x onto stack.
    void push(int x) {
      in.push(x);
    }

    // Removes the element on top of the stack.
    void pop() {
      last_to_head();
      in.pop();
    }

    // Get the top element.
    int top() {
      last_to_head();
      int t = in.front();
      in.push(in.front());
      in.pop();
      return t;
    }

    // Return whether the stack is empty.
    bool empty() {
      return in.empty();
    }
  };
#+END_SRC
