docs/challenges.html

<div id="outline-container-orgde4db36" class="outline-3">
<h3 id="orgde4db36">219. Contains Duplicate II</h3>
<div class="outline-text-3" id="text-orgde4db36">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
    <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">containsNearbyDuplicate</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&amp; <span style="color: #cae682;">nums</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">k</span>) {
        <span style="color: #92a65e; font-weight: bold;">unordered_set</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">nearby</span>;

        <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;nums.size(); i++) {
            <span style="color: #8ac6f2; font-weight: bold;">if</span> (nearby.find(<span style="color: #92a65e; font-weight: bold;">nums</span>[i]) != nearby.end())
                <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">true</span>;

            nearby.insert(<span style="color: #92a65e; font-weight: bold;">nums</span>[i]);

            <span style="color: #8ac6f2; font-weight: bold;">if</span> (i&gt;=k)
                nearby.erase(<span style="color: #92a65e; font-weight: bold;">nums</span>[i-k]);
        }

        <span style="color: #8ac6f2; font-weight: bold;">return</span> <span style="color: #e5786d;">false</span>;
    }
};
</pre>
</div>
</div>
</div>
<div id="outline-container-orgdb4ba58" class="outline-3">
<h3 id="orgdb4ba58">221. Maximal Square</h3>
<div class="outline-text-3" id="text-orgdb4ba58">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">access</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&gt;&amp; <span style="color: #cae682;">matrix</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">x</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">y</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">if</span> (x &lt; matrix.size() <span style="color: #8ac6f2; font-weight: bold;">and</span> x &gt;= 0 <span style="color: #8ac6f2; font-weight: bold;">and</span> y &gt;= 0 <span style="color: #8ac6f2; font-weight: bold;">and</span> y &lt; matrix[x].size())
      <span style="color: #8ac6f2; font-weight: bold;">return</span> matrix[x][y];
    <span style="color: #8ac6f2; font-weight: bold;">else</span>
      <span style="color: #8ac6f2; font-weight: bold;">return</span> 0;
  }

  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">triangle</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">left</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">right</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">up</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">down</span>) {
    <span style="color: #8ac6f2; font-weight: bold;">return</span> (min(min(left,right),up) + 1) * down;
  }

  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">maximalSquare</span>(<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">char</span>&gt;&gt;&amp; <span style="color: #cae682;">matrix</span>) {
    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Transforms the matrix into an int matrix</span>
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt;&gt; <span style="color: #cae682;">imatrix</span>;
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;matrix.size(); i++) {
      <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">row</span>;
      <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">j</span>=0; j&lt;matrix[0].size(); j++)
        row.push_back(<span style="color: #92a65e; font-weight: bold;">matrix</span>[i][j]-<span style="color: #95e454;">'0'</span>);
      imatrix.push_back(row);
    }

    <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Finds square</span>
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">max</span> = 0;
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;imatrix.size(); i++) {
      <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">j</span>=0; j&lt;imatrix[0].size(); j++) {
        imatrix[i][j] = triangle(access(<span style="color: #92a65e; font-weight: bold;">imatrix</span>, i-1, j), access(<span style="color: #92a65e; font-weight: bold;">imatrix</span>, i, j-1), access(<span style="color: #92a65e; font-weight: bold;">imatrix</span>,i-1,j-1), access(<span style="color: #92a65e; font-weight: bold;">imatrix</span>, i, j));
        <span style="color: #8ac6f2; font-weight: bold;">if</span> (max &lt; imatrix[i][j])
          max = imatrix[i][j];
      }
      cout &lt;&lt; endl;
    }

    <span style="color: #8ac6f2; font-weight: bold;">return</span> max*max;
  }   
};
</pre>
</div>
</div>
</div>

<div id="outline-container-org2a123cd" class="outline-3">
<h3 id="org2a123cd">225. Implement Stack using Queues</h3>
<div class="outline-text-3" id="text-org2a123cd">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Stack</span> {
<span style="color: #8ac6f2; font-weight: bold;">private</span>:
  <span style="color: #92a65e; font-weight: bold;">queue</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">in</span>;

  <span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">last_to_head</span>() {
    <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=0; i&lt;in.size()-1; i++) {
      in.push(in.front());
      in.pop();
    }
  }

<span style="color: #8ac6f2; font-weight: bold;">public</span>:
  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Push element x onto stack.</span>
  <span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">push</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">x</span>) {
    in.push(x);
  }

  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Removes the element on top of the stack.</span>
  <span style="color: #92a65e; font-weight: bold;">void</span> <span style="color: #cae682;">pop</span>() {
    last_to_head();
    in.pop();
  }

  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Get the top element.</span>
  <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">top</span>() {
    last_to_head();
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">t</span> = in.front();
    in.push(in.front());
    in.pop();
    <span style="color: #8ac6f2; font-weight: bold;">return</span> t;
  }

  <span style="color: #5F7F5F;">// </span><span style="color: #99968b;">Return whether the stack is empty.</span>
  <span style="color: #92a65e; font-weight: bold;">bool</span> <span style="color: #cae682;">empty</span>() {
    <span style="color: #8ac6f2; font-weight: bold;">return</span> in.empty();
  }
};
</pre>
</div>
</div>
</div>
