docs/challenges.html
<div id="outline-container-orgdafdbc6" class="outline-3">
<h3 id="orgdafdbc6">371. Sum of two integers</h3>
<div class="outline-text-3" id="text-orgdafdbc6">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">getSum</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">a</span>, <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">b</span>) {
        <span style="color: #8ac6f2; font-weight: bold;">if</span> (b == 0)
            <span style="color: #8ac6f2; font-weight: bold;">return</span> a;
        <span style="color: #8ac6f2; font-weight: bold;">return</span> getSum(a ^ b, (<span style="color: #92a65e; font-weight: bold;">a</span> &amp; <span style="color: #cae682;">b</span>) &lt;&lt; 1);
    }
};
</pre>
</div>
</div>
</div>
<div id="outline-container-orgfc92702" class="outline-3">
<h3 id="orgfc92702">388. Counting Bits</h3>
<div class="outline-text-3" id="text-orgfc92702">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
    <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">countBits</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">num</span>) {
        <span style="color: #92a65e; font-weight: bold;">vector</span>&lt;<span style="color: #92a65e; font-weight: bold;">int</span>&gt; <span style="color: #cae682;">count</span>(num+1,0);

        <span style="color: #8ac6f2; font-weight: bold;">for</span> (<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">i</span>=1; i&lt;num+1; i++)
            count[i] = count[i&gt;&gt;1] + (<span style="color: #92a65e; font-weight: bold;">i</span>&amp;1);

        <span style="color: #8ac6f2; font-weight: bold;">return</span> count;
    }
};
</pre>
</div>
</div>
</div>
<div id="outline-container-org2cf9158" class="outline-3">
<h3 id="org2cf9158">397. Integer Replacement</h3>
<div class="outline-text-3" id="text-org2cf9158">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">public</span>:
    <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">integerReplacement</span>(<span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">n</span>) {
        <span style="color: #8ac6f2; font-weight: bold;">if</span> (n == 2147483647) <span style="color: #8ac6f2; font-weight: bold;">return</span> 32;

        <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">counter</span> = 0;

        <span style="color: #8ac6f2; font-weight: bold;">while</span> (n &gt; 3) {
            <span style="color: #8ac6f2; font-weight: bold;">if</span> (n &amp; 1) {
                <span style="color: #8ac6f2; font-weight: bold;">if</span> (n &amp; 2)
                    n++;
                <span style="color: #8ac6f2; font-weight: bold;">else</span> 
                    n--;
            }
            <span style="color: #8ac6f2; font-weight: bold;">else</span> 
                n &gt;&gt;= 1;
            counter++;
        }

        <span style="color: #8ac6f2; font-weight: bold;">if</span> (n==3) <span style="color: #8ac6f2; font-weight: bold;">return</span> 2+counter;
        <span style="color: #8ac6f2; font-weight: bold;">if</span> (n==2) <span style="color: #8ac6f2; font-weight: bold;">return</span> 1+counter;
        <span style="color: #8ac6f2; font-weight: bold;">return</span> counter;
    }
};
</pre>
</div>
</div>
</div>
<div id="outline-container-orgc559de7" class="outline-3">
<h3 id="orgc559de7"><span class="done DONE">DONE</span> 412. Fizz Buzz</h3>
</div>
<div id="outline-container-orgccd0e40" class="outline-3">
<h3 id="orgccd0e40"><span class="done DONE">DONE</span> 441. Arranging Coins</h3>
</div>
<div id="outline-container-orgcf45d87" class="outline-3">
<h3 id="orgcf45d87">445. Add two numbers</h3>
<div class="outline-text-3" id="text-orgcf45d87">
</div><div id="outline-container-org272dfe8" class="outline-4">
<h4 id="org272dfe8">Reversing lists solution</h4>
<div class="outline-text-4" id="text-org272dfe8">
<div class="org-src-container">
<pre class="src src-cpp"><span style="color: #5F7F5F;">/**</span>
<span style="color: #99968b;"> * Definition for singly-linked list.</span>
<span style="color: #99968b;"> * struct ListNode {</span>
<span style="color: #99968b;"> *     int val;</span>
<span style="color: #99968b;"> *     ListNode* next;</span>
<span style="color: #99968b;"> *     ListNode(int x) : val(x), next(NULL) {}</span>
<span style="color: #99968b;"> * };</span>
<span style="color: #99968b;"> */</span>
<span style="color: #8ac6f2; font-weight: bold;">class</span> <span style="color: #92a65e; font-weight: bold;">Solution</span> {
<span style="color: #8ac6f2; font-weight: bold;">private</span>:
    <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">reverse</span>(<span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">head</span>) {
        <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">previous</span> = <span style="color: #e5786d;">nullptr</span>;
        <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">current</span> = head;

        <span style="color: #8ac6f2; font-weight: bold;">while</span> (current != <span style="color: #e5786d;">nullptr</span>) {
            <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">following</span> = current-&gt;next;
            current-&gt;next = previous;
            previous = current;
            current = following;
        }

        <span style="color: #8ac6f2; font-weight: bold;">return</span> previous;
    }

    <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">skipzeroes</span>(<span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">sum</span>) {
        <span style="color: #8ac6f2; font-weight: bold;">while</span> (sum != <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">and</span> sum-&gt;val==0)
            sum = sum-&gt;next;

        <span style="color: #8ac6f2; font-weight: bold;">if</span> (sum == <span style="color: #e5786d;">nullptr</span>)
            sum = <span style="color: #8ac6f2; font-weight: bold;">new</span> <span style="color: #92a65e; font-weight: bold;">ListNode</span>(0);

        <span style="color: #8ac6f2; font-weight: bold;">return</span> sum;
    }


<span style="color: #8ac6f2; font-weight: bold;">public</span>:
    <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">addTwoNumbers</span>(<span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">l1</span>, <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">l2</span>) {
        l1 = reverse(l1);
        l2 = reverse(l2);
        <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">sum</span> = <span style="color: #8ac6f2; font-weight: bold;">new</span> <span style="color: #92a65e; font-weight: bold;">ListNode</span>(0);
        <span style="color: #92a65e; font-weight: bold;">ListNode</span>* <span style="color: #cae682;">current</span> = sum;

        <span style="color: #8ac6f2; font-weight: bold;">while</span> (l1 != <span style="color: #e5786d;">nullptr</span> <span style="color: #8ac6f2; font-weight: bold;">or</span> l2 != <span style="color: #e5786d;">nullptr</span>) {
            <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">l1val</span> = (l1 == <span style="color: #e5786d;">nullptr</span>? 0 : l1-&gt;val);
            <span style="color: #92a65e; font-weight: bold;">int</span> <span style="color: #cae682;">l2val</span> = (l2 == <span style="color: #e5786d;">nullptr</span>? 0 : l2-&gt;val);
            current-&gt;val += l1val+l2val;

            current-&gt;next = <span style="color: #8ac6f2; font-weight: bold;">new</span> <span style="color: #92a65e; font-weight: bold;">ListNode</span>(current-&gt;val &gt; 9? 1 : 0);
            current-&gt;val %= 10;
            current = current-&gt;next;
            l1 = (l1 == <span style="color: #e5786d;">nullptr</span>? <span style="color: #e5786d;">nullptr</span> : l1-&gt;next);
            l2 = (l2 == <span style="color: #e5786d;">nullptr</span>? <span style="color: #e5786d;">nullptr</span> : l2-&gt;next);
        }

        sum = reverse(sum);
        sum = skipzeroes(sum);

        <span style="color: #8ac6f2; font-weight: bold;">return</span> sum;
    }
};
</pre>
</div>
</div>
</div>
</div>
